STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_sdmmc_core.h
  * @brief   Header file of SDMMC core driver module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_SDMMC_CORE_H
#define STM32U5XX_SDMMC_CORE_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @defgroup SDMMC_CORE SDMMC Core
  * @{
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_CORE_Exported_Types SDMMC_CORE Exported Types
  * @{
  */

/*! SDMMC Configuration Structure definition */
typedef struct
{
  uint32_t clock_edge;            /*!< Specifies the SDMMC_CCK clock transition on which Data and Command change.
                                      This parameter can be a value of @ref SDMMC_CORE_Clock_Edge                 */
  uint32_t clock_power_save;      /*!< Specifies whether SDMMC Clock output is enabled or
                                      disabled when the bus is idle.
                                      This parameter can be a value of @ref SDMMC_CORE_Clock_Power_Save           */
  uint32_t clock_div;             /*!< Specifies the clock frequency of the SDMMC controller.
                                      This parameter can be a value between Min_Data = 0 and Max_Data = 1023      */
} sdmmc_clk_config_t;

/*! SDMMC Configuration Structure definition */
typedef struct
{
  sdmmc_clk_config_t clk;         /*!< Specifies the SDMMC clock config.                                        */
  uint32_t bus_wide;              /*!< Specifies the SDMMC bus width.
                                      This parameter can be a value of @ref SDMMC_CORE_Bus_Wide                 */
  uint32_t hardware_flow_control; /*!< Specifies whether the SDMMC hardware flow control is enabled or disabled.
                                      This parameter can be a value of @ref SDMMC_CORE_Hardware_Flow_Control    */
  uint32_t tranceiver_present;    /*!< Specifies if there is a 1V8 Transceiver/Switcher.
                                      This parameter can be a value of @ref SDMMC_CORE_TRANSCEIVER_PRESENT      */
} sdmmc_config_t;

/*! SDMMC Command Control structure */
typedef struct
{
  uint32_t argument;           /*!< Specifies the SDMMC command argument which is sent to a card as part of a command
                                    message. If a command contains an argument, it must be loaded into this register
                                    before writing the command to the command register.                               */
  uint32_t cmd_index;          /*!< Specifies the SDMMC command index. It must be Min_Data = 0 and Max_Data = 64      */
  uint32_t response;           /*!< Specifies the SDMMC response type.
                                    This parameter can be a value of @ref SDMMC_CORE_Response_Type                    */
  uint32_t wait_for_interrupt; /*!< Specifies whether SDMMC wait for interrupt request is enabled or disabled.
                                    This parameter can be a value of @ref SDMMC_CORE_Wait_Interrupt_State             */
  uint32_t cpsm;               /*!< Specifies whether SDMMC Command path state machine (CPSM) is enabled or disabled.
                                    This parameter can be a value of @ref SDMMC_CORE_CPSM_State                       */
} sdmmc_cmd_init_t;

/*! SDMMC Data Control structure */
typedef struct
{
  uint32_t data_timeout;    /*!< Specifies the data timeout period in card bus clock periods.                    */
  uint32_t data_length;     /*!< Specifies the number of data bytes to be transferred.                           */
  uint32_t data_block_size; /*!< Specifies the data block size for block transfer.
                                 This parameter can be a value of @ref SDMMC_CORE_Data_Block_Size                */
  uint32_t transfer_dir;    /*!< Specifies the data transfer direction, whether the transfer
                                 is a read or write.
                                 This parameter can be a value of @ref SDMMC_CORE_Transfer_Direction             */
  uint32_t transfer_mode;   /*!< Specifies whether data transfer is in stream or block mode.
                                 This parameter can be a value of @ref SDMMC_CORE_Transfer_Type                  */
  uint32_t dpsm;            /*!< Specifies whether SDMMC Data path state machine (DPSM) is enabled or disabled.
                                 This parameter can be a value of @ref SDMMC_CORE_DPSM_State                     */
} sdmmc_data_ctrl_t;

/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_CORE_Exported_Constants SDMMC CORE Exported Constants
  * @{
  */
/** @defgroup SDMMC_Block_Size_byte SDMMC Block Size byte
  * @{
  */
#define SDMMC_BLOCK_SIZE_BYTE   512U
/**
  * @}
  */

/** @defgroup SDMMC_Transceiver_state SDMMC Transceiver state
  * @{
  */
#define SDMMC_TRANSCEIVER_DISABLE  0x00 /*!< Transceiver disable */
#define SDMMC_TRANSCEIVER_ENABLE   0x01 /*!< Transceiver enable  */
#define IS_SDMMC_TRANSCEIVER(TRANSCEIVER) ((TRANSCEIVER == SDMMC_TRANSCEIVER_DISABLE) \
                                           || (TRANSCEIVER == SDMMC_TRANSCEIVER_ENABLE))
/**
  * @}
  */

/** @defgroup SDMMC_error_types SDMMC error types
  * @{
  */
#define SDMMC_ERROR_NONE                   0x00000000U /*!< No error                                                      */
#define SDMMC_ERROR_CMD_CRC_FAIL           0x00000001U /*!< Command response received (but CRC check failed)              */
#define SDMMC_ERROR_DATA_CRC_FAIL          0x00000002U /*!< Data block sent/received (CRC check failed)                   */
#define SDMMC_ERROR_CMD_RSP_TIMEOUT        0x00000004U /*!< Command response timeout                                      */
#define SDMMC_ERROR_DATA_TIMEOUT           0x00000008U /*!< Data timeout                                                  */
#define SDMMC_ERROR_TX_UNDERRUN            0x00000010U /*!< Transmit FIFO underrun                                        */
#define SDMMC_ERROR_RX_OVERRUN             0x00000020U /*!< Receive FIFO overrun                                          */
#define SDMMC_ERROR_ADDR_MISALIGNED        0x00000040U /*!< Misaligned address                                            */
#define SDMMC_ERROR_BLOCK_LEN_ERR          0x00000080U /*!< Transferred block length is not allowed for the card or the number of transferred bytes does not match the block length   */
#define SDMMC_ERROR_ERASE_SEQ_ERR          0x00000100U /*!< An error in the sequence of erase command occurs              */
#define SDMMC_ERROR_BAD_ERASE_PARAM        0x00000200U /*!< An invalid selection for erase groups                         */
#define SDMMC_ERROR_WRITE_PROT_VIOLATION   0x00000400U /*!< Attempt to program a write protect block                      */
#define SDMMC_ERROR_LOCK_UNLOCK_FAILED     0x00000800U /*!< Sequence or password error has been detected in unlock command or if there was an attempt to access a locked card    */
#define SDMMC_ERROR_COM_CRC_FAILED         0x00001000U /*!< CRC check of the previous command failed                      */
#define SDMMC_ERROR_ILLEGAL_CMD            0x00002000U /*!< Command is not legal for the card state                       */
#define SDMMC_ERROR_CARD_ECC_FAILED        0x00004000U /*!< Card internal ECC was applied but failed to correct the data  */
#define SDMMC_ERROR_CC_ERR                 0x00008000U /*!< Internal card controller error                                */
#define SDMMC_ERROR_GENERAL_UNKNOWN_ERR    0x00010000U /*!< General or unknown error                                      */
#define SDMMC_ERROR_STREAM_READ_UNDERRUN   0x00020000U /*!< The card could not sustain data reading in stream mode        */
#define SDMMC_ERROR_STREAM_WRITE_OVERRUN   0x00040000U /*!< The card could not sustain data programming in stream mode    */
#define SDMMC_ERROR_CID_CSD_OVERWRITE      0x00080000U /*!< CID/CSD overwrite error                                       */
#define SDMMC_ERROR_WP_ERASE_SKIP          0x00100000U /*!< Only partial address space was erased                         */
#define SDMMC_ERROR_CARD_ECC_DISABLED      0x00200000U /*!< Command has been executed without using internal ECC          */
#define SDMMC_ERROR_ERASE_RESET            0x00400000U /*!< Erase sequence was cleared before executing because an out of erase sequence command was received                        */
#define SDMMC_ERROR_AKE_SEQ_ERR            0x00800000U /*!< Error in sequence of authentication                           */
#define SDMMC_ERROR_INVALID_VOLTRANGE      0x01000000U /*!< Error in case of invalid voltage range                        */
#define SDMMC_ERROR_ADDR_OUT_OF_RANGE      0x02000000U /*!< Error when addressed block is out of range                    */
#define SDMMC_ERROR_REQUEST_NOT_APPLICABLE 0x04000000U /*!< Error when command request is not applicable                  */
#define SDMMC_ERROR_INVALID_PARAMETER      0x08000000U /*!< the used parameter is not valid                               */
#define SDMMC_ERROR_UNSUPPORTED_FEATURE    0x10000000U /*!< Error when feature is not supported                           */
#define SDMMC_ERROR_BUSY                   0x20000000U /*!< Error when transfer process is busy                           */
#define SDMMC_ERROR_DMA                    0x40000000U /*!< Error while DMA transfer                                      */
#define SDMMC_ERROR_TIMEOUT                0x80000000U /*!< Timeout error                                                 */
/**
  * @}
  */

/** @defgroup SDMMC_SDIO_Commands_Index SDMMC Commands Index
  * @{
  */
/**
  * @brief  Masks for R5 Response
  */
/** this is the reserved for future use in spec RFU */
#define SDMMC_SDIO_R5_ERROR                          ((uint32_t)0x00000400U)
/** Out of range error */
#define SDMMC_SDIO_R5_OUT_OF_RANGE                   ((uint32_t)0x00000100U)
/** Invalid function number */
#define SDMMC_SDIO_R5_INVALID_FUNCTION_NUMBER        ((uint32_t)0x00000200U)
/** General or an unknown error */
#define SDMMC_SDIO_R5_GENERAL_UNKNOWN_ERROR          ((uint32_t)0x00000800U)
/** SDIO Card current state
  * 00=DIS (card not selected)
  * 01=CMD (data line free)
  * 10=TRN (transfer on data lines) */
#define SDMMC_SDIO_R5_IO_CURRENT_STATE               ((uint32_t)0x00003000U)
/** Illegal command error */
#define SDMMC_SDIO_R5_ILLEGAL_CMD                    ((uint32_t)0x00004000U)
/** CRC check of previous cmd failed */
#define SDMMC_SDIO_R5_COM_CRC_FAILED                 ((uint32_t)0x00008000U)

