STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
#define SDMMC_SDIO_R5_ERRORBITS                      (SDMMC_SDIO_R5_COM_CRC_FAILED            \
                                                      | SDMMC_SDIO_R5_ILLEGAL_CMD             \
                                                      | SDMMC_SDIO_R5_GENERAL_UNKNOWN_ERROR   \
                                                      | SDMMC_SDIO_R5_INVALID_FUNCTION_NUMBER \
                                                      | SDMMC_SDIO_R5_OUT_OF_RANGE)
/**
  * @brief SDIO_CMD53_MODE
  */
#define SDMMC_SDIO_MODE_BYTE                         0x00U  /*!< Byte Mode  */
#define SDMMC_SDIO_MODE_BLOCK                        0x01U  /*!< Block Mode */

/**
  * @brief SDIO_CMD53_OP_CODE
  */
#define SDMMC_SDIO_NO_INC                            0x00U  /*!< No auto indentation */
#define SDMMC_SDIO_AUTO_INC                          0x01U  /*!< Auto indentation    */

/**
  * @brief SDIO_CMD53_RAW
  */
#define SDMMC_SDIO_WO                                0x00U  /*!< Write only Flag       */
#define SDMMC_SDIO_RAW                               0x01U  /*!< Read after write Flag */
/**
  * @}
  */

/** @defgroup SDMMC_Commands_Index SDMMC Commands Index
  * @{
  */
#define SDMMC_CMD_GO_IDLE_STATE        0U   /*!< Resets the SD memory card.                                                               */
#define SDMMC_CMD_SEND_OP_COND         1U   /*!< Send host capacity support information and activates the card's initialization process.  */
#define SDMMC_CMD_ALL_SEND_CID         2U   /*!< Asks any card connected to the host to send the CID numbers on the CMD line.             */
#define SDMMC_CMD_SET_REL_ADDR         3U   /*!< Asks the card to publish a new relative address (RCA).                                   */
#define SDMMC_CMD_SET_DSR              4U   /*!< Programs the DSR of all cards.                                                           */
#define SDMMC_CMD_SDMMC_SEN_OP_COND    5U   /*!< Send host capacity support information (HCS) and asks the accessed card to send its operating condition register (OCR) content in the response on the CMD line.*/
#define SDMMC_CMD_HS_SWITCH            6U   /*!< Checks switchable function (mode 0) and switch card function (mode 1).                   */
#define SDMMC_CMD_SEL_DESEL_CARD       7U   /*!< Selects the card by its own relative address and gets deselected by any other address    */
#define SDMMC_CMD_HS_SEND_EXT_CSD      8U   /*!< Send SD Memory Card interface condition, which includes host supply voltage information  and asks the card whether card supports voltage.                      */
#define SDMMC_CMD_SEND_CSD             9U   /*!< Addressed card sends its card specific data (CSD) on the CMD line.                       */
#define SDMMC_CMD_SEND_CID             10U  /*!< Addressed card sends its card identification (CID) on the CMD line.                      */
#define SDMMC_CMD_VOLTAGE_SWITCH       11U  /*!< SD card Voltage switch to 1.8V mode.                                                     */
#define SDMMC_CMD_STOP_TRANSMISSION    12U  /*!< Forces the card to stop transmission.                                                    */
#define SDMMC_CMD_SEND_STATUS          13U  /*!< Addressed card sends its status register.                                                */
#define SDMMC_CMD_HS_BUSTEST_READ      14U  /*!< Reserved                                                                                 */
#define SDMMC_CMD_GO_INACTIVE_STATE    15U  /*!< Send an addressed card into the inactive state.                                          */
#define SDMMC_CMD_SET_BLOCKLEN         16U  /*!< Sets the block length (in bytes for SDSC) for all following block commands (read, write, lock). Default block length is fixed to 512 Bytes. Not effective        */
/*!< for SDHS and SDXC.                                                                       */
#define SDMMC_CMD_READ_SINGLE_BLOCK    17U  /*!< Reads single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of fixed 512 bytes in case of SDHC and SDXC.                                    */
#define SDMMC_CMD_READ_MULT_BLOCK      18U  /*!< Continuously transfers data blocks from card to host until interrupted by  STOP_TRANSMISSION command.                                                            */
#define SDMMC_CMD_HS_BUSTEST_WRITE     19U  /*!< 64 bytes tuning pattern is sent for SDR50 and SDR104.                                    */
#define SDMMC_CMD_WRITE_DAT_UNTIL_STOP 20U  /*!< Speed class control command.                                                             */
#define SDMMC_CMD_SET_BLOCK_COUNT      23U  /*!< Specify block count for CMD18 and CMD25.                                                 */
#define SDMMC_CMD_WRITE_SINGLE_BLOCK   24U  /*!< Writes single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of fixed 512 bytes in case of SDHC and SDXC.                                   */
#define SDMMC_CMD_WRITE_MULT_BLOCK     25U  /*!< Continuously writes blocks of data until a STOP_TRANSMISSION follows.                    */
#define SDMMC_CMD_PROG_CID             26U  /*!< Reserved for manufacturers.                                                              */
#define SDMMC_CMD_PROG_CSD             27U  /*!< Programming of the programmable bits of the CSD.                                         */
#define SDMMC_CMD_SET_WRITE_PROT       28U  /*!< Sets the write protection bit of the addressed group.                                    */
#define SDMMC_CMD_CLR_WRITE_PROT       29U  /*!< Clears the write protection bit of the addressed group.                                  */
#define SDMMC_CMD_SEND_WRITE_PROT      30U  /*!< Asks the card to send the status of the write protection bits.                           */
#define SDMMC_CMD_SD_ERASE_GRP_START   32U  /*!< Sets the address of the first write block to be erased. (For SD card only).              */
#define SDMMC_CMD_SD_ERASE_GRP_END     33U  /*!< Sets the address of the last write block of the continuous range to be erased.           */
#define SDMMC_CMD_ERASE_GRP_START      35U  /*!< Sets the address of the first write block to be erased. Reserved for each command system set by switch function command (CMD6).                                  */
#define SDMMC_CMD_ERASE_GRP_END        36U  /*!< Sets the address of the last write block of the continuous range to be erased. Reserved for each command system set by switch function command (CMD6).           */
#define SDMMC_CMD_ERASE                38U  /*!< Reserved for SD security applications.                                                   */
#define SDMMC_CMD_FAST_IO              39U  /*!< SD card doesn't support it (Reserved).                                                   */
#define SDMMC_CMD_GO_IRQ_STATE         40U  /*!< SD card doesn't support it (Reserved).                                                   */
#define SDMMC_CMD_LOCK_UNLOCK          42U  /*!< Sets/resets the password or lock/unlock the card. The size of the data block is set by the SET_BLOCK_LEN command.                                                */
#define SDMMC_CMD_APP_CMD              55U  /*!< Indicates to the card that the next command is an application specific command rather than a standard command.                                                   */
#define SDMMC_CMD_GEN_CMD              56U  /*!< Used either to transfer a data block to the card or to get a data block from the card for general purpose/application specific commands.                         */
#define SDMMC_CMD_NO_CMD               64U  /*!< No command                                                                               */
/**
  * @}
  */

/** @defgroup SDMMC_SD_Card_Specific_commands SDMMC SD Card Specific commands
  * @{
  */
#define SDMMC_CMD_APP_SD_SET_BUSWIDTH          6U   /*!< (ACMD6) Defines the data bus width to be used for data transfer. The allowed data bus widths are given in SCR register.                                                   */
#define SDMMC_CMD_SD_APP_STATUS                13U  /*!< (ACMD13) Send the SD status.                                                             */
#define SDMMC_CMD_SD_APP_SEND_NUM_WRITE_BLOCKS 22U  /*!< (ACMD22) Send the number of the written (without errors) write blocks. Responds with 32bit+CRC data block.                                                                */
#define SDMMC_CMD_SD_APP_OP_COND               41U  /*!< (ACMD41) Send host capacity support information (HCS) and asks the accessed card to send its operating condition register (OCR) content in the response on the CMD line.  */
#define SDMMC_CMD_SD_APP_SET_CLR_CARD_DETECT   42U  /*!< (ACMD42) Connect/Disconnect the 50 KOhm pull-up resistor on CD/DAT3 (pin 1) of the card  */
#define SDMMC_CMD_SD_APP_SEND_SCR              51U  /*!< Reads the SD Configuration Register (SCR).                                               */
#define SDMMC_CMD_SDMMC_RW_DIRECT              52U  /*!< For SD I/O card only, reserved for security specification.                               */
#define SDMMC_CMD_SDMMC_RW_EXTENDED            53U  /*!< For SD I/O card only, reserved for security specification.                               */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_Specific_commands SDMMC MMC Specific commands
  * @{
  */
#define SDMMC_CMD_MMC_SLEEP_AWAKE 5 /*!< Toggle the device between Sleep state and Standby state */
/**
  * @}
  */

/** @defgroup SDMMC_SD_Card_Specific_security_commands SDMMC SD Card Specific security commands
  * @{
  */
#define SDMMC_CMD_SD_APP_GET_MKB                     43U
#define SDMMC_CMD_SD_APP_GET_MID                     44U
#define SDMMC_CMD_SD_APP_SET_CER_RN1                 45U
#define SDMMC_CMD_SD_APP_GET_CER_RN2                 46U
#define SDMMC_CMD_SD_APP_SET_CER_RES2                47U
#define SDMMC_CMD_SD_APP_GET_CER_RES1                48U
#define SDMMC_CMD_SD_APP_SECURE_READ_MULTIPLE_BLOCK  18U
#define SDMMC_CMD_SD_APP_SECURE_WRITE_MULTIPLE_BLOCK 25U
#define SDMMC_CMD_SD_APP_SECURE_ERASE                38U
#define SDMMC_CMD_SD_APP_CHANGE_SECURE_AREA          49U
#define SDMMC_CMD_SD_APP_SECURE_WRITE_MKB            48U
/**
  * @}
  */

/** @defgroup SDMMC_Masks_for_errors_Card_Status_R1 SDMMC Masks for errors Card Status R1 (OCR Register)
  * @{
  */
#define SDMMC_OCR_ADDR_OUT_OF_RANGE     0x80000000U
#define SDMMC_OCR_ADDR_MISALIGNED       0x40000000U
#define SDMMC_OCR_BLOCK_LEN_ERR         0x20000000U
#define SDMMC_OCR_ERASE_SEQ_ERR         0x10000000U
#define SDMMC_OCR_BAD_ERASE_PARAM       0x08000000U
#define SDMMC_OCR_WRITE_PROT_VIOLATION  0x04000000U
#define SDMMC_OCR_LOCK_UNLOCK_FAILED    0x01000000U
#define SDMMC_OCR_COM_CRC_FAILED        0x00800000U
#define SDMMC_OCR_ILLEGAL_CMD           0x00400000U
#define SDMMC_OCR_CARD_ECC_FAILED       0x00200000U
#define SDMMC_OCR_CC_ERROR              0x00100000U
#define SDMMC_OCR_GENERAL_UNKNOWN_ERROR 0x00080000U
#define SDMMC_OCR_STREAM_READ_UNDERRUN  0x00040000U
#define SDMMC_OCR_STREAM_WRITE_OVERRUN  0x00020000U
#define SDMMC_OCR_CID_CSD_OVERWRITE     0x00010000U
#define SDMMC_OCR_WP_ERASE_SKIP         0x00008000U
#define SDMMC_OCR_CARD_ECC_DISABLED     0x00004000U
#define SDMMC_OCR_ERASE_RESET           0x00002000U
#define SDMMC_OCR_AKE_SEQ_ERROR         0x00000008U
#define SDMMC_OCR_ERRORBITS             0xFDFFE008U
/**
  * @}
  */

/** @defgroup SDMMC_Masks_for_R6_Response SDMMC Masks for R6 Response
  * @{
  */
#define SDMMC_R6_GENERAL_UNKNOWN_ERROR 0x00002000U
#define SDMMC_R6_ILLEGAL_CMD           0x00004000U
#define SDMMC_R6_COM_CRC_FAILED        0x00008000U
/**
  * @}
  */

/** @defgroup SDMMC_Speed_Switch_Pattern SDMMC Speed Switch Pattern
  * @{
  */
#define SDMMC_VOLTAGE_WINDOW_SD       0x80100000U
#define SDMMC_HIGH_CAPACITY           0x40000000U
#define SDMMC_STD_CAPACITY            0x00000000U
#define SDMMC_CHECK_PATTERN           0x000001AAU
#define SDMMC_SD_SWITCH_1_8V_CAPACITY 0x01000000U
#define SDMMC_DDR50_SWITCH_PATTERN    0x80FFFF04U
#define SDMMC_SDR104_SWITCH_PATTERN   0x80FF1F03U
#define SDMMC_SDR50_SWITCH_PATTERN    0x80FF1F02U
#define SDMMC_SDR25_SWITCH_PATTERN    0x80FFFF01U
#define SDMMC_SDR12_SWITCH_PATTERN    0x80FFFF00U
/**
  * @}
  */

/** @defgroup SDMMC_Trial_Times SDMMC trial times
  * @{
  */
#define SDMMC_MAX_VOLT_TRIAL  0x0000FFFFU
#define SDMMC_MAX_TRIAL       0x0000FFFFU
#define SDMMC_ALLZERO         0x00000000U
#define SDMMC_MAX_DATA_LENGTH 0x01FFFFFFU
/**
  * @}
  */

