STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/** @defgroup SDMMC_Fifo_Size SDMMC Fifo size
  * @{
  */
#define SDMMC_FIFO_SIZE 32U /*!< Half full FIFO data size in byte */
/**
  * @}
  */

/** @defgroup SDMMC_Wide_Bus_Supported SDMMC Wide bus supported
  * @{
  */
#define SDMMC_WIDE_BUS_SUPPORT    0x00040000U
#define SDMMC_SINGLE_BUS_SUPPORT  0x00010000U
/**
  * @}
  */

/** @defgroup SDMMC_Bit_numbering SDMMC Bit numbering
  * @{
  */
#define SDMMC_0TO7BITS    0x000000FFU
#define SDMMC_8TO15BITS   0x0000FF00U
#define SDMMC_16TO23BITS  0x00FF0000U
#define SDMMC_24TO31BITS  0xFF000000U
/**
  * @}
  */

/** @defgroup SDMMC_Command_Class_supported SDMMC Command Class supported
  * @{
  */
#define SDMMC_CCCC_ERASE 0x00000020U
/**
  * @}
  */

/** @defgroup SDMMC_Cmd_Tiemout SDMMC Cmd Timeout
  * @{
  */
#define SDMMC_CMD_TIMEOUT  100U  /*!< 100ms are required for an command response timeout */
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Clock_Edge Clock Edge
  * @{
  */
#define SDMMC_CLOCK_EDGE_RISING  0x00000000U
#define SDMMC_CLOCK_EDGE_FALLING SDMMC_CLKCR_NEGEDGE
#define IS_SDMMC_CLOCK_EDGE(EDGE) ((EDGE == SDMMC_CLOCK_EDGE_RISING) || (EDGE == SDMMC_CLOCK_EDGE_FALLING))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Clock_Power_Save Clock Power Saving
  * @{
  */
#define SDMMC_CLOCK_POWER_SAVE_DISABLE   0x00000000U
#define SDMMC_CLOCK_POWER_SAVE_ENABLE    SDMMC_CLKCR_PWRSAV
#define IS_SDMMC_CLOCK_POWER_SAVE(SAVE)  ((SAVE == SDMMC_CLOCK_POWER_SAVE_DISABLE) \
                                          || (SAVE == SDMMC_CLOCK_POWER_SAVE_ENABLE))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Bus_Wide Bus Width
  * @{
  */
#define SDMMC_BUS_WIDE_1BIT     0x00000000U
#define SDMMC_BUS_WIDE_4BIT     SDMMC_CLKCR_WIDBUS_0
#define SDMMC_BUS_WIDE_8BIT     SDMMC_CLKCR_WIDBUS_1
#define IS_SDMMC_BUS_WIDE(WIDE) ((WIDE == SDMMC_BUS_WIDE_1BIT) || (WIDE == SDMMC_BUS_WIDE_4BIT) \
                                 || (WIDE == SDMMC_BUS_WIDE_8BIT))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Hardware_Flow_Control Hardware Flow Control
  * @{
  */
#define SDMMC_HARDWARE_FLOW_CONTROL_DISABLE      0x00000000U
#define SDMMC_HARDWARE_FLOW_CONTROL_ENABLE       SDMMC_CLKCR_HWFC_EN
#define IS_SDMMC_HARDWARE_FLOW_CONTROL(CONTROL)  ((CONTROL == SDMMC_HARDWARE_FLOW_CONTROL_DISABLE) \
                                                  || (CONTROL == SDMMC_HARDWARE_FLOW_CONTROL_ENABLE))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Speed_Mode SDMMC Speed Mode
  * @{
  */
#define SDMMC_SPEED_MODE_AUTO         0x00000000U
#define SDMMC_SPEED_MODE_DEFAULT      0x00000001U
#define SDMMC_SPEED_MODE_HIGH         0x00000002U
#define SDMMC_SPEED_MODE_ULTRA        0x00000003U
#define SDMMC_SPEED_MODE_ULTRA_SDR104 SDMMC_SPEED_MODE_ULTRA
#define SDMMC_SPEED_MODE_DDR          0x00000004U
#define SDMMC_SPEED_MODE_ULTRA_SDR50  0x00000005U

#define IS_SDMMC_SPEED_MODE(MODE) ((MODE == SDMMC_SPEED_MODE_AUTO) || (MODE == SDMMC_SPEED_MODE_DEFAULT)  \
                                   || (MODE == SDMMC_SPEED_MODE_HIGH) || (MODE == SDMMC_SPEED_MODE_ULTRA) \
                                   || (MODE == SDMMC_SPEED_MODE_ULTRA_SDR50) || (MODE == SDMMC_SPEED_MODE_DDR))

/**
  * @}
  */

/** @defgroup SDMMC_CORE_TRANSCEIVER_PRESENT Transceiver Present
  * @{
  */
#define SDMMC_TRANSCEIVER_UNKNOWN     0x00000000U
#define SDMMC_TRANSCEIVER_NOT_PRESENT 0x00000001U
#define SDMMC_TRANSCEIVER_PRESENT     0x00000002U
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Command_Index Command Index
  * @{
  */
#define IS_SDMMC_CMD_INDEX(INDEX) ((INDEX) < 0x40U)
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Response_Type Response Type
  * @{
  */
#define SDMMC_RESPONSE_NO           0x00000000U
#define SDMMC_RESPONSE_SHORT        SDMMC_CMDR_WAITRESP_0
#define SDMMC_RESPONSE_LONG         SDMMC_CMDR_WAITRESP
#define IS_SDMMC_RESPONSE(RESPONSE) ((RESPONSE == SDMMC_RESPONSE_NO) || (RESPONSE == SDMMC_RESPONSE_SHORT) \
                                     || (RESPONSE == SDMMC_RESPONSE_LONG))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Wait_Interrupt_State Wait Interrupt
  * @{
  */
#define SDMMC_WAIT_NO       0x00000000U
#define SDMMC_WAIT_IT       SDMMC_CMDR_WAITINT
#define SDMMC_WAIT_PEND     SDMMC_CMDR_WAITPEND
#define IS_SDMMC_WAIT(WAIT) ((WAIT == SDMMC_WAIT_NO) || (WAIT == SDMMC_WAIT_IT) || (WAIT == SDMMC_WAIT_PEND))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_CPSM_State CPSM State
  * @{
  */
#define SDMMC_CPSM_DISABLE   0x00000000U
#define SDMMC_CPSM_ENABLE    SDMMC_CMDR_CPSMEN
#define IS_SDMMC_CPSM(CPSM)  ((CPSM == SDMMC_CPSM_DISABLE) || (CPSM == SDMMC_CPSM_ENABLE))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Response_Registers Response Register
  * @{
  */
#define SDMMC_RESP1          0x00000000U
#define SDMMC_RESP2          0x00000004U
#define SDMMC_RESP3          0x00000008U
#define SDMMC_RESP4          0x0000000CU
#define IS_SDMMC_RESP(RESP)  ((RESP == SDMMC_RESP1) || (RESP == SDMMC_RESP2) || (RESP == SDMMC_RESP3) \
                              || (RESP == SDMMC_RESP4))
/**
  * @}
  */

/** @defgroup SDMMC_Internal_DMA_Mode  SDMMC Internal DMA Mode
  * @{
  */
#define SDMMC_DISABLE_IDMA             0x00000000U
#define SDMMC_ENABLE_IDMA_SINGLE_BUFF  SDMMC_IDMA_IDMAEN
#define SDMMC_ENABLE_IDMA_DOUBLE_BUFF0 (SDMMC_IDMA_IDMAEN | SDMMC_IDMA_IDMABMODE)
#define SDMMC_ENABLE_IDMA_DOUBLE_BUFF1 (SDMMC_IDMA_IDMAEN | SDMMC_IDMA_IDMABMODE | SDMMC_IDMA_IDMABACT)
#define SDMMC_IDMA_NORMAL_MODE         0U
#define SDMMC_IDMA_LINKEDLIST_MODE     SDMMC_IDMA_IDMABMODE
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Data_Block_Size  Data Block Size
  * @{
  */
#define SDMMC_DATABLOCK_SIZE_1B     0x00000000U
#define SDMMC_DATABLOCK_SIZE_2B     SDMMC_DCTRL_DBLOCKSIZE_0
#define SDMMC_DATABLOCK_SIZE_4B     SDMMC_DCTRL_DBLOCKSIZE_1
#define SDMMC_DATABLOCK_SIZE_8B     (SDMMC_DCTRL_DBLOCKSIZE_0 | SDMMC_DCTRL_DBLOCKSIZE_1)
#define SDMMC_DATABLOCK_SIZE_16B    SDMMC_DCTRL_DBLOCKSIZE_2
#define SDMMC_DATABLOCK_SIZE_32B    (SDMMC_DCTRL_DBLOCKSIZE_0 | SDMMC_DCTRL_DBLOCKSIZE_2)
#define SDMMC_DATABLOCK_SIZE_64B    (SDMMC_DCTRL_DBLOCKSIZE_1 | SDMMC_DCTRL_DBLOCKSIZE_2)
#define SDMMC_DATABLOCK_SIZE_128B   (SDMMC_DCTRL_DBLOCKSIZE_0 | SDMMC_DCTRL_DBLOCKSIZE_1|SDMMC_DCTRL_DBLOCKSIZE_2)
#define SDMMC_DATABLOCK_SIZE_256B   SDMMC_DCTRL_DBLOCKSIZE_3
#define SDMMC_DATABLOCK_SIZE_512B   (SDMMC_DCTRL_DBLOCKSIZE_0 | SDMMC_DCTRL_DBLOCKSIZE_3)
#define SDMMC_DATABLOCK_SIZE_1024B  (SDMMC_DCTRL_DBLOCKSIZE_1 | SDMMC_DCTRL_DBLOCKSIZE_3)
#define SDMMC_DATABLOCK_SIZE_2048B  (SDMMC_DCTRL_DBLOCKSIZE_0 | SDMMC_DCTRL_DBLOCKSIZE_1|SDMMC_DCTRL_DBLOCKSIZE_3)
#define SDMMC_DATABLOCK_SIZE_4096B  (SDMMC_DCTRL_DBLOCKSIZE_2 | SDMMC_DCTRL_DBLOCKSIZE_3)
#define SDMMC_DATABLOCK_SIZE_8192B  (SDMMC_DCTRL_DBLOCKSIZE_0 | SDMMC_DCTRL_DBLOCKSIZE_2 | SDMMC_DCTRL_DBLOCKSIZE_3)
#define SDMMC_DATABLOCK_SIZE_16384B (SDMMC_DCTRL_DBLOCKSIZE_1 | SDMMC_DCTRL_DBLOCKSIZE_2 | SDMMC_DCTRL_DBLOCKSIZE_3)

#define IS_SDMMC_BLOCK_SIZE(SIZE) ((SIZE == SDMMC_DATABLOCK_SIZE_1B)       || (SIZE == SDMMC_DATABLOCK_SIZE_2B)    \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_4B)    || (SIZE == SDMMC_DATABLOCK_SIZE_8B)    \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_16B)   || (SIZE == SDMMC_DATABLOCK_SIZE_32B)   \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_64B)   || (SIZE == SDMMC_DATABLOCK_SIZE_128B)  \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_256B)  || (SIZE == SDMMC_DATABLOCK_SIZE_512B)  \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_1024B) || (SIZE == SDMMC_DATABLOCK_SIZE_2048B) \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_4096B) || (SIZE == SDMMC_DATABLOCK_SIZE_8192B) \
                                   || (SIZE == SDMMC_DATABLOCK_SIZE_16384B))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Transfer_Direction Transfer Direction
  * @{
  */
#define SDMMC_TRANSFER_DIR_TO_CARD   0x00000000U
#define SDMMC_TRANSFER_DIR_TO_SDMMC  SDMMC_DCTRL_DTDIR
#define IS_SDMMC_TRANSFER_DIR(DIR)   ((DIR == SDMMC_TRANSFER_DIR_TO_CARD) || (DIR == SDMMC_TRANSFER_DIR_TO_SDMMC))
/**
  * @}
  */

