STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/** @defgroup SDMMC_CORE_Transfer_Type Transfer Type
  * @{
  */
#define SDMMC_TRANSFER_MODE_BLOCK    0x00U
#define SDMMC_TRANSFER_MODE_SDIO     SDMMC_DCTRL_DTMODE_0
#define SDMMC_TRANSFER_MODE_STREAM   SDMMC_DCTRL_DTMODE_1
#define IS_SDMMC_TRANSFER_MODE(MODE) ((MODE == SDMMC_TRANSFER_MODE_BLOCK)     \
                                      || ((MODE) == SDMMC_TRANSFER_MODE_SDIO) \
                                      || (MODE == SDMMC_TRANSFER_MODE_STREAM))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_DPSM_State DPSM State
  * @{
  */
#define SDMMC_DPSM_DISABLE   0x00U
#define SDMMC_DPSM_ENABLE    SDMMC_DCTRL_DTEN
#define IS_SDMMC_DPSM(DPSM)  ((DPSM == SDMMC_DPSM_DISABLE) || (DPSM == SDMMC_DPSM_ENABLE))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Read_Wait_Mode Read Wait Mode
  * @{
  */
#define SDMMC_READ_WAIT_MODE_DATA2    0x00
#define SDMMC_READ_WAIT_MODE_CLK      SDMMC_DCTRL_RWMOD
#define IS_SDMMC_READWAIT_MODE(MODE)  ((MODE == SDMMC_READ_WAIT_MODE_CLK) || (MODE == SDMMC_READ_WAIT_MODE_DATA2))
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Interrupt_sources Interrupt Sources
  * @{
  */
#define SDMMC_IT_CCRCFAIL   SDMMC_MASKR_CCRCFAILIE
#define SDMMC_IT_DCRCFAIL   SDMMC_MASKR_DCRCFAILIE
#define SDMMC_IT_CTIMEOUT   SDMMC_MASKR_CTIMEOUTIE
#define SDMMC_IT_DTIMEOUT   SDMMC_MASKR_DTIMEOUTIE
#define SDMMC_IT_TXUNDERR   SDMMC_MASKR_TXUNDERRIE
#define SDMMC_IT_RXOVERR    SDMMC_MASKR_RXOVERRIE
#define SDMMC_IT_CMDREND    SDMMC_MASKR_CMDRENDIE
#define SDMMC_IT_CMDSENT    SDMMC_MASKR_CMDSENTIE
#define SDMMC_IT_DATAEND    SDMMC_MASKR_DATAENDIE
#define SDMMC_IT_DHOLD      SDMMC_MASKR_DHOLDIE
#define SDMMC_IT_DBCKEND    SDMMC_MASKR_DBCKENDIE
#define SDMMC_IT_DABORT     SDMMC_MASKR_DABORTIE
#define SDMMC_IT_TXFIFOHE   SDMMC_MASKR_TXFIFOHEIE
#define SDMMC_IT_RXFIFOHF   SDMMC_MASKR_RXFIFOHFIE
#define SDMMC_IT_RXFIFOF    SDMMC_MASKR_RXFIFOFIE
#define SDMMC_IT_TXFIFOE    SDMMC_MASKR_TXFIFOEIE
#define SDMMC_IT_BUSYD0END  SDMMC_MASKR_BUSYD0ENDIE
#define SDMMC_IT_SDIOIT     SDMMC_MASKR_SDIOITIE
#define SDMMC_IT_ACKFAIL    SDMMC_MASKR_ACKFAILIE
#define SDMMC_IT_ACKTIMEOUT SDMMC_MASKR_ACKTIMEOUTIE
#define SDMMC_IT_VSWEND     SDMMC_MASKR_VSWENDIE
#define SDMMC_IT_CKSTOP     SDMMC_MASKR_CKSTOPIE
#define SDMMC_IT_IDMABTC    SDMMC_MASKR_IDMABTCIE
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Flags_sources Flags Sources
  * @{
  */
#define SDMMC_FLAG_CCRCFAIL   SDMMC_STAR_CCRCFAIL
#define SDMMC_FLAG_DCRCFAIL   SDMMC_STAR_DCRCFAIL
#define SDMMC_FLAG_CTIMEOUT   SDMMC_STAR_CTIMEOUT
#define SDMMC_FLAG_DTIMEOUT   SDMMC_STAR_DTIMEOUT
#define SDMMC_FLAG_TXUNDERR   SDMMC_STAR_TXUNDERR
#define SDMMC_FLAG_RXOVERR    SDMMC_STAR_RXOVERR
#define SDMMC_FLAG_CMDREND    SDMMC_STAR_CMDREND
#define SDMMC_FLAG_CMDSENT    SDMMC_STAR_CMDSENT
#define SDMMC_FLAG_DATAEND    SDMMC_STAR_DATAEND
#define SDMMC_FLAG_DHOLD      SDMMC_STAR_DHOLD
#define SDMMC_FLAG_DBCKEND    SDMMC_STAR_DBCKEND
#define SDMMC_FLAG_DABORT     SDMMC_STAR_DABORT
#define SDMMC_FLAG_DPSMACT    SDMMC_STAR_DPSMACT
#define SDMMC_FLAG_CMDACT     SDMMC_STAR_CPSMACT
#define SDMMC_FLAG_TXFIFOHE   SDMMC_STAR_TXFIFOHE
#define SDMMC_FLAG_RXFIFOHF   SDMMC_STAR_RXFIFOHF
#define SDMMC_FLAG_TXFIFOF    SDMMC_STAR_TXFIFOF
#define SDMMC_FLAG_RXFIFOF    SDMMC_STAR_RXFIFOF
#define SDMMC_FLAG_TXFIFOE    SDMMC_STAR_TXFIFOE
#define SDMMC_FLAG_RXFIFOE    SDMMC_STAR_RXFIFOE
#define SDMMC_FLAG_BUSYD0     SDMMC_STAR_BUSYD0
#define SDMMC_FLAG_BUSYD0END  SDMMC_STAR_BUSYD0END
#define SDMMC_FLAG_SDIOIT     SDMMC_STAR_SDIOIT
#define SDMMC_FLAG_ACKFAIL    SDMMC_STAR_ACKFAIL
#define SDMMC_FLAG_ACKTIMEOUT SDMMC_STAR_ACKTIMEOUT
#define SDMMC_FLAG_VSWEND     SDMMC_STAR_VSWEND
#define SDMMC_FLAG_CKSTOP     SDMMC_STAR_CKSTOP
#define SDMMC_FLAG_IDMATE     SDMMC_STAR_IDMATE
#define SDMMC_FLAG_IDMABTC    SDMMC_STAR_IDMABTC

#define SDMMC_STATIC_FLAGS (SDMMC_FLAG_CCRCFAIL  | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_CTIMEOUT | SDMMC_FLAG_DTIMEOUT  \
                            | SDMMC_FLAG_TXUNDERR  | SDMMC_FLAG_RXOVERR  | SDMMC_FLAG_CMDREND  | SDMMC_FLAG_CMDSENT \
                            | SDMMC_FLAG_DATAEND   | SDMMC_FLAG_DHOLD    | SDMMC_FLAG_DBCKEND  | SDMMC_FLAG_DABORT  \
                            | SDMMC_FLAG_BUSYD0END | SDMMC_FLAG_SDIOIT   | SDMMC_FLAG_ACKFAIL  | SDMMC_FLAG_IDMABTC \
                            | SDMMC_FLAG_VSWEND    | SDMMC_FLAG_CKSTOP   | SDMMC_FLAG_IDMATE   | SDMMC_FLAG_ACKTIMEOUT)

#define SDMMC_STATIC_CMD_FLAGS (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CTIMEOUT  | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CMDSENT \
                                | SDMMC_FLAG_BUSYD0END)

#define SDMMC_STATIC_DATA_FLAGS (SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DHOLD    \
                                 | SDMMC_FLAG_RXOVERR  | SDMMC_FLAG_DATAEND  | SDMMC_FLAG_DBCKEND  | SDMMC_FLAG_IDMATE \
                                 | SDMMC_FLAG_DABORT   | SDMMC_FLAG_IDMABTC)
/**
  * @}
  */

/** @defgroup SDMMC_SDIO_CCCR_Registers SDMMC SDIO CCCR Registers
  * @{
  */
/*-------------------------------- CCCR0 ----------------------------------*/
#define SDMMC_SDIO_CCCR0                  0x000U  /*!< SDIOS Card Common Control Register 0        */
#define SDMMC_SDIO_CCCR0_BYTE0            0x000U  /*!< SDIOS Card Common Control Register 0 Byte 0 */
#define SDMMC_SDIO_CCCR0_BYTE1            0x001U  /*!< SDIOS Card Common Control Register 0 Byte 1 */
#define SDMMC_SDIO_CCCR0_BYTE2            0x002U  /*!< SDIOS Card Common Control Register 0 Byte 2 */
#define SDMMC_SDIO_CCCR0_BYTE3            0x003U  /*!< SDIOS Card Common Control Register 0 Byte 3 */

/*-------------------------------- CCCR4 ----------------------------------*/
#define SDMMC_SDIO_CCCR4                  0x004U  /*!< SDIOS Card Common Control Register 4        */
#define SDMMC_SDIO_CCCR4_BYTE0            0x004U  /*!< SDIOS Card Common Control Register 4 Byte 0 */
#define SDMMC_SDIO_CCCR4_BYTE1            0x005U  /*!< SDIOS Card Common Control Register 4 Byte 1 */
#define SDMMC_SDIO_CCCR4_BYTE2            0x006U  /*!< SDIOS Card Common Control Register 4 Byte 2 */
#define SDMMC_SDIO_CCCR4_BYTE3            0x007U  /*!< SDIOS Card Common Control Register 4 Byte 3 */

/*-------------------------------- CCCR8 ----------------------------------*/
#define SDMMC_SDIO_CCCR8                  0x008U  /*!< SDIOS Card Common Control Register 8        */
#define SDMMC_SDIO_CCCR8_BYTE0            0x008U  /*!< SDIOS Card Common Control Register 8 Byte 0 */
#define SDMMC_SDIO_CCCR8_BYTE1            0x009U  /*!< SDIOS Card Common Control Register 8 Byte 1 */
#define SDMMC_SDIO_CCCR8_BYTE2            0x00AU  /*!< SDIOS Card Common Control Register 8 Byte 2 */
#define SDMMC_SDIO_CCCR8_BYTE3            0x00BU  /*!< SDIOS Card Common Control Register 8 Byte 3 */

