STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/*-------------------------------- CCCR12 ---------------------------------*/
#define SDMMC_SDIO_CCCR12                 0x00CU  /*!< SDIOS Card Common Control Register 12        */
#define SDMMC_SDIO_CCCR12_BYTE0           0x00CU  /*!< SDIOS Card Common Control Register 12 Byte 0 */
#define SDMMC_SDIO_CCCR12_BYTE1           0x00DU  /*!< SDIOS Card Common Control Register 12 Byte 1 */
#define SDMMC_SDIO_CCCR12_BYTE2           0x00EU  /*!< SDIOS Card Common Control Register 12 Byte 2 */
#define SDMMC_SDIO_CCCR12_BYTE3           0x00FU  /*!< SDIOS Card Common Control Register 12 Byte 3 */

/*-------------------------------- CCCR16 ---------------------------------*/
#define SDMMC_SDIO_CCCR16                 0x010U  /*!< SDIOS Card Common Control Register 16        */
#define SDMMC_SDIO_CCCR16_BYTE0           0x010U  /*!< SDIOS Card Common Control Register 16 Byte 0 */
#define SDMMC_SDIO_CCCR16_BYTE1           0x011U  /*!< SDIOS Card Common Control Register 16 Byte 1 */
#define SDMMC_SDIO_CCCR16_BYTE2           0x012U  /*!< SDIOS Card Common Control Register 16 Byte 2 */
#define SDMMC_SDIO_CCCR16_BYTE3           0x013U  /*!< SDIOS Card Common Control Register 16 Byte 3 */

/*-------------------------------- CCCR20 ---------------------------------*/
#define SDMMC_SDIO_CCCR20                 0x014U  /*!< SDIOS Card Common Control Register 20        */
#define SDMMC_SDIO_CCCR20_BYTE0           0x014U  /*!< SDIOS Card Common Control Register 20 Byte 0 */
#define SDMMC_SDIO_CCCR20_BYTE1           0x015U  /*!< SDIOS Card Common Control Register 20 Byte 1 */
#define SDMMC_SDIO_CCCR20_BYTE2           0x016U  /*!< SDIOS Card Common Control Register 20 Byte 2 */
#define SDMMC_SDIO_CCCR20_BYTE3           0x017U  /*!< SDIOS Card Common Control Register 20 Byte 3 */

/*-------------------------------- F1BR0 ----------------------------------*/
#define SDMMC_SDIO_F1BR0                  0x100U  /*!< SDIOS Function 1 Basic Register 0        */
#define SDMMC_SDIO_F1BR0_BYTE0            0x100U  /*!< SDIOS Function 1 Basic Register 0 Byte 0 */
#define SDMMC_SDIO_F1BR0_BYTE1            0x101U  /*!< SDIOS Function 1 Basic Register 0 Byte 1 */
#define SDMMC_SDIO_F1BR0_BYTE2            0x102U  /*!< SDIOS Function 1 Basic Register 0 Byte 2 */
#define SDMMC_SDIO_F1BR0_BYTE3            0x103U  /*!< SDIOS Function 1 Basic Register 0 Byte 3 */

/*-------------------------------- F1BR8 ----------------------------------*/
#define SDMMC_SDIO_F1BR8                  0x108U  /*!< SDIOS Function 1 Basic Register 8        */
#define SDMMC_SDIO_F1BR8_BYTE0            0x108U  /*!< SDIOS Function 1 Basic Register 8 Byte 0 */
#define SDMMC_SDIO_F1BR8_BYTE1            0x109U  /*!< SDIOS Function 1 Basic Register 8 Byte 1 */
#define SDMMC_SDIO_F1BR8_BYTE2            0x10AU  /*!< SDIOS Function 1 Basic Register 8 Byte 2 */
#define SDMMC_SDIO_F1BR8_BYTE3            0x10BU  /*!< SDIOS Function 1 Basic Register 8 Byte 3 */

/*-------------------------------- F1BR12 ---------------------------------*/
#define SDMMC_SDIO_F1BR12                 0x10CU  /*!< SDIOS Function 1 Basic Register 12        */
#define SDMMC_SDIO_F1BR12_BYTE0           0x10CU  /*!< SDIOS Function 1 Basic Register 12 Byte 0 */
#define SDMMC_SDIO_F1BR12_BYTE1           0x10DU  /*!< SDIOS Function 1 Basic Register 12 Byte 1 */
#define SDMMC_SDIO_F1BR12_BYTE2           0x10EU  /*!< SDIOS Function 1 Basic Register 12 Byte 2 */
#define SDMMC_SDIO_F1BR12_BYTE3           0x10FU  /*!< SDIOS Function 1 Basic Register 12 Byte 3 */

/*-------------------------------- F1BR16 ---------------------------------*/
#define SDMMC_SDIO_F1BR16                 0x110U  /*!< SDIOS Function 1 Basic Register 16        */
#define SDMMC_SDIO_F1BR16_BYTE0           0x110U  /*!< SDIOS Function 1 Basic Register 16 Byte 0 */
#define SDMMC_SDIO_F1BR16_BYTE1           0x111U  /*!< SDIOS Function 1 Basic Register 16 Byte 1 */
#define SDMMC_SDIO_F1BR16_BYTE2           0x112U  /*!< SDIOS Function 1 Basic Register 16 Byte 2 */
#define SDMMC_SDIO_F1BR16_BYTE3           0x113U  /*!< SDIOS Function 1 Basic Register 16 Byte 3 */
/**
  * @}
  */

/** @defgroup SDMMC_CORE_SDIO_BUS_SPEED SDMMC CORE SDIO Bus Speed Definitions
  * @{
  */
#define SDMMC_SDIO_BUS_SPEED_SDR12        0x00U /*!< SDMMC SDIO bus speed mode SDR12  */
#define SDMMC_SDIO_BUS_SPEED_SDR25        0x02U /*!< SDMMC SDIO bus speed mode SDR25  */
#define SDMMC_SDIO_BUS_SPEED_SDR50        0x04U /*!< SDMMC SDIO bus speed mode SDR50  */
#define SDMMC_SDIO_BUS_SPEED_SDR104       0x06U /*!< SDMMC SDIO bus speed mode SDR104 */
#define SDMMC_SDIO_BUS_SPEED_DDR50        0x08U /*!< SDMMC SDIO bus speed mode DDR50  */
/**
  * @}
  */

/** @defgroup SDMMC_CORE_SDIO_BLOCK_SIZE SDMMC CORE SDIO Block Size Definitions
  * @{
  */
#define SDMMC_SDIO_BLOCK_SIZE_1BYTE        1U    /*!< SDIO block size 1 byte    */
#define SDMMC_SDIO_BLOCK_SIZE_2BYTE        2U    /*!< SDIO block size 2 byte    */
#define SDMMC_SDIO_BLOCK_SIZE_4BYTE        4U    /*!< SDIO block size 4 byte    */
#define SDMMC_SDIO_BLOCK_SIZE_8BYTE        8U    /*!< SDIO block size 8 byte    */
#define SDMMC_SDIO_BLOCK_SIZE_16BYTE       16U   /*!< SDIO block size 16 byte   */
#define SDMMC_SDIO_BLOCK_SIZE_32BYTE       32U   /*!< SDIO block size 32 byte   */
#define SDMMC_SDIO_BLOCK_SIZE_64BYTE       64U   /*!< SDIO block size 64 byte   */
#define SDMMC_SDIO_BLOCK_SIZE_128BYTE      128U  /*!< SDIO block size 128 byte  */
#define SDMMC_SDIO_BLOCK_SIZE_256BYTE      256U  /*!< SDIO block size 256 byte  */
#define SDMMC_SDIO_BLOCK_SIZE_512BYTE      512U  /*!< SDIO block size 512 byte  */
#define SDMMC_SDIO_BLOCK_SIZE_1024BYTE     1024U /*!< SDIO block size 1024 byte */
#define SDMMC_SDIO_BLOCK_SIZE_2048BYTE     2048U /*!< SDIO block size 2048 byte */
/**
  * @}
  */

/** @defgroup SDMMC_CORE_registers_bits_and_address SDMMC registers bits and address in the alias region
  * @{
  */
/*!< CLKCR register clear mask */
#define CLKCR_CLEAR_MASK (SDMMC_CLKCR_CLKDIV  | SDMMC_CLKCR_PWRSAV | SDMMC_CLKCR_WIDBUS   | SDMMC_CLKCR_NEGEDGE \
                          | SDMMC_CLKCR_HWFC_EN | SDMMC_CLKCR_DDR    | SDMMC_CLKCR_BUSSPEED | SDMMC_CLKCR_SELCLKRX)

/*!< SDMMC DCTRL Clear Mask */
#define DCTRL_CLEAR_MASK  (SDMMC_DCTRL_DTEN | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTMODE | SDMMC_DCTRL_DBLOCKSIZE)

/*!< CMD Register clear mask */
#define CMD_CLEAR_MASK (SDMMC_CMDR_CMDINDEX | SDMMC_CMDR_WAITRESP | SDMMC_CMDR_WAITINT | SDMMC_CMDR_WAITPEND \
                        | SDMMC_CMDR_CPSMEN   | SDMMC_CMDR_CMDSUSPEND)
/**
  * @}
  */

/** @defgroup SDMMC_Power SDMMC Power Definitions
  * @{
  */
#define SDMMC_PWR_OFF 0U                    /*!< SDMMC power off */
#define SDMMC_PWR_ON  SDMMC_POWER_PWRCTRL   /*!< SDMMC power on  */
#define SDMMC_PWR_UP  SDMMC_POWER_PWRCTRL_1 /*!< SDMMC power up  */
/**
  * @}
  */

/**
  * @}
  */
/* Private Constants -------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_SD_Private_Constants SDMMC SD Private Constants
  * @{
  */

/** @defgroup SDMMC_SD_Frequency SDMMC SD frequency types structure definition
  * @{
  */
#define SDMMC_SD_CARD_INIT_FREQ       400000U    /*!< Initialization phase   : 400 kHz max */
#define SDMMC_SD_CARD_NS_SPEED_FREQ   25000000U  /*!< Normal speed phase     : 25 MHz max  */
#define SDMMC_SD_CARD_HS_SPEED_FREQ   50000000U  /*!< High speed phase       : 50 MHz max  */
#define SDMMC_SD_CARD_UHS_SPEED_FREQ  100000000U /*!< Ultra High speed phase : 100 MHz max */
/**
  * @}
  */

/** @defgroup SDMMC_SD_Memory_Types SDMMC SD memory types structure definition
  * @{
  */
#define SDMMC_SD_CARD_SDSC      0x00UL /*!< SD Standard Capacity < 2Go                          */
#define SDMMC_SD_CARD_SDHC_SDXC 0x01UL /*!< SD High Capacity < 32Go, SD Extended Capacity < 2To */
#define SDMMC_SD_CARD_SECURED   0x03UL /*!< SD Card secured type                                */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_Frequency SDMMC MMC frequency types structure definition
  * @{
  */
#define SDMMC_MMC_INIT_FREQ           (400000U)   /*!< Initialization phase : 400 kHz max */
#define SDMMC_MMC_HIGH_SPEED_FREQ     (52000000U) /*!< High speed phase   : 52 MHz max    */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_Memory_Types SDMMC MMC memory types structure definition
  * @{
  */
#define SDMMC_MMC_CARD_LC  (0x00U) /*!< MMC Card Low Capacity <=2Gbytes              */
#define SDMMC_MMC_CARD_HC  (0x01U) /*!< MMC Card High Capacity >2Gbytes and <2Tbytes */
/**
  * @}
  */

