STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/** @defgroup SDMMC_SD_supported_version SDMMC SD supported version structure definition
  * @{
  */
#define SDMMC_SD_CARD_V1_X 0x00UL /*!< Supported card version 1.x */
#define SDMMC_SD_CARD_V2_X 0x01UL /*!< Supported card version 2.x */
/**
  * @}
  */

/** @defgroup SDMMC_SD_speed_types SDMMC SD speed types structure definition
  * @{
  */
#define SDMMC_SD_CARD_NORMAL_SPEED     0x0000U /*!< Normal Speed Card < 12.5Mo/s : Spec Version 1.01                                          */
#define SDMMC_SD_CARD_HIGH_SPEED       0x0100U /*!< High Speed Card < 25Mo/s : Spec version 2.00                                              */
#define SDMMC_SD_CARD_ULTRA_HIGH_SPEED 0x0200U /*!< UHS-I SD Card < 50Mo/s for SDR50, DDR5 Cards and < 104Mo/s for SDR104 : Spec version 3.01 */
/**
  * @}
  */

/** @defgroup SDMMC_transfer_context SDMMC transfer context structure definition
  * @{
  */
#define SDMMC_CONTEXT_NONE                 0x00UL /*!< None                            */
#define SDMMC_CONTEXT_READ_SINGLE_BLOCK    0x01UL /*!< Read single block operation     */
#define SDMMC_CONTEXT_READ_MULTIPLE_BLOCK  0x02UL /*!< Read multiple blocks operation  */
#define SDMMC_CONTEXT_WRITE_SINGLE_BLOCK   0x10UL /*!< Write single block operation    */
#define SDMMC_CONTEXT_WRITE_MULTIPLE_BLOCK 0x20UL /*!< Write multiple blocks operation */
#define SDMMC_CONTEXT_IT                   0x08UL /*!< Process in Interrupt mode       */
#define SDMMC_CONTEXT_DMA                  0x80UL /*!< Process in DMA mode             */
/**
  * @}
  */

/** @defgroup SDMMC_SD_Card_SCR_Data_Size_Byte SDMMC SD Card SCR Data Size Byte definition
  * @{
  */
#define SDMMC_SD_CARD_SCR_DATA_SIZE_BYTE    8U  /*!< SD SCR Data size byte */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_BUS_WIDTH_SELECTION SDMMC MMC Bus Width Selection definition
  * @{
  */
#define SDMMC_MMC_BUS_WIDTH_1_DEFAULT_SPEED 0x03B70000U /*!< MMC argument to set a 1-bit for default speed mode */
#define SDMMC_MMC_BUS_WIDTH_4_HS            0x03B70100U /*!< MMC argument to set a 4-bit for High speed mode    */
#define SDMMC_MMC_BUS_WIDTH_8_HS            0x03B70200U /*!< MMC argument to set a 8-bit for High speed mode    */
#define SDMMC_MMC_BUS_WIDTH_4_DDR           0x03B70500U /*!< MMC argument to set a 4-bit for DDR mode           */
#define SDMMC_MMC_BUS_WIDTH_8_DDR           0x03B70600U /*!< MMC argument to set a 8-bit for DDR mode           */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_ARG_FOR_SANITIZE_OPERATIOn SDMMC MMC argument to start the sanitize operation definition
  * @{
  */
#define SDMMC_MMC_START_SANITIZE_OPERATION  0x03A50100U /*!< MMC argument to start the sanitize operation */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_SLEEP_AWAKE_TIMEOUT SDMMC MMC sleep/awake timeout definition
  * @{
  */
#define SDMMC_MMC_S_A_TIMEOUT  0x17U /*!< Max Sleep-Awake timeout value (Bit[217] of ext_csd register)  */
/**
  * @}
  */

/** @defgroup SDMMC_MMC_POWER_OFF_NOTIFICATION SDMMC MMC Power Off Notification definition
  * @{
  */
#define SDMMC_MMC_SET_PWR_OFF_NOTIF_TO_PWR_ON       0x03220100U /*!< Set the power-off notification to powered-on : ext_csd[34] = 1         */
#define SDMMC_MMC_SET_PWR_OFF_NOTIF_TO_SLEEP_NOTIF  0x03220400U /*!< Set the power-off notification to sleep notification : ext_csd[34] = 4 */
/**
  * @}
  */

/** @defgroup SDMMC_MMCHIGH_SPEED_TIMMING SDMMC MMC High Speed Timing definition
  * @{
  */
#define SDMMC_MMC_TIMMING_INTERFACE_DEFAULT  0x03B90000U /*!< Selecting backwards compatibility interface timing ext_csd[185] = 0 */
#define SDMMC_MMC_TIMMING_INTERFACE_HS       0x03B90100U /*!< interface timing for HS ext_csd[185] = 1                            */
/**
  * @}
  */

/** @defgroup SDMMC_SD_Card_Specification_Version SDMMC SD Card Specification Version definition
  * @{
  */
#define SDMMC_SD_CARD_SPEC_POS    24U          /*!< SDMMC SD card spec position  */
#define SDMMC_SD_CARD_SPEC_MSK    0x0F000000UL /*!< 0x0F000000UL                 */
#define SDMMC_SD_CARD_SPEC_3_POS  15U          /*!< SDMMC SD card spec3 position */
#define SDMMC_SD_CARD_SPEC_3_MSK  0x00008000UL /*!< 0x00008000UL                 */
#define SDMMC_SD_CARD_SPEC_4_POS  10U          /*!< SDMMC SD card spec4 position */
#define SDMMC_SD_CARD_SPEC_4_MSK  0x00000400UL /*!< 0x00000400UL                 */
#define SDMMC_SD_CARD_SPEC_5_POS  6U           /*!< SDMMC SD card spec5 position */
#define SDMMC_SD_CARD_SPEC_5_MSK  0x000003C0UL /*!< 0x000003C0UL                 */
/**
  * @}
  */

/** @defgroup SDMMC_Card_Identification_Data SDMMC Card Identification Data definition
  * @{
  */
#define SDMMC_MANUFACTURE_ID_POS       24U          /*!< SD/MMC card manufacture ID position        */
#define SDMMC_MANUFACTURE_ID_MSK       0xFF000000U  /*!< 0xFF000000U                                */
#define SDMMC_OEM_APP_ID_POS           8U           /*!< SD/MMC card OEM Application ID position    */
#define SDMMC_OEM_APP_ID_MSK           0x00FFFF00U  /*!< 0x00FFFF00U                                */
#define SDMMC_PRODUCT_NAME_PART1_POS   0U           /*!< SD/MMC card product name1 position         */
#define SDMMC_PRODUCT_NAME_PART1_MSK   0x000000FFU  /*!< 0x000000FFU                                */
#define SDMMC_PRODUCT_NAME_PART2_POS   0U           /*!< SD/MMC card product name2 position         */
#define SDMMC_PRODUCT_NAME_PART2_MSK   0xFFFFFFFFU  /*!< 0xFFFFFFFFU                                */
#define SDMMC_PRODUCT_REVISION_POS     24U          /*!< SD/MMC card product revision position      */
#define SDMMC_PRODUCT_REVISION_MSK     0xFF000000U  /*!< 0xFF000000U                                */
#define SDMMC_PRODUCT_SERIAL_NBR2_POS  0U           /*!< SD/MMC card product serial number position */
#define SDMMC_PRODUCT_SERIAL_NBR2_MSK  0x00FFFFFFU  /*!< 0x00FFFFFFU                                */
#define SDMMC_PRODUCT_SERIAL_NBR1_POS  24U          /*!< SD/MMC card serial number1 position        */
#define SDMMC_PRODUCT_SERIAL_NBR1_MSK  0xFF000000U  /*!< 0xFF000000U                                */
#define SDMMC_RESERVED_POS             20U          /*!< SD/MMC card reserved position              */
#define SDMMC_RESERVED_MSK             0x00F00000U  /*!< 0x00F00000U                                */
#define SDMMC_MANUFACTURE_DATE_POS     8U           /*!< SD/MMC card manufacture date position      */
#define SDMMC_MANUFACTURE_DATE_MSK     0x000FFF00U  /*!< 0x000FFF00U                                */
#define SDMMC_CID_CRC_POS              1U           /*!< SD/MMC card CID crc position               */
#define SDMMC_CID_CRC_MSK              0x000000FEU  /*!< 0x000000FEU                                */
#define SDMMC_NOT_USED_POS             0U           /*!< SD/MMC card Not used                       */
#define SDMMC_NOT_USED_MSK             0x00000001U  /*!< 0x00000001                                 */
/**
  * @}
  */

