STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/** @defgroup MMC_Card_Specific_Data MMC Card Specific Data definition
  * @{
  */
#define SDMMC_MMC_CARD_DEVICE_SIZE1_POS      0U           /*!< MMC Card Device size 1 position              */
#define SDMMC_MMC_CARD_DEVICE_SIZE1_MSK      0x000003FFU  /*!< 0x000003FFU                                  */
#define SDMMC_MMC_CARD_DEVICE_SIZE2_POS      30U          /*!< MMC Card Ddevice size 2 position             */
#define SDMMC_MMC_CARD_DEVICE_SIZE2_MSK      0xC0000000U  /*!< 0xC0000000U                                  */
#define SDMMC_MMC_CARD_DEVICE_SIZE_MUL_POS   15U          /*!< MMC Card Device size Mul position            */
#define SDMMC_MMC_CARD_DEVICE_SIZE_MUL_MSK   0x00038000U  /*!< 0x00038000U                                  */
#define SDMMC_MMC_CARD_READ_BLOCK_LEN_POS    16U          /*!< MMC Card read block len position             */
#define SDMMC_MMC_CARD_READ_BLOCK_LEN_MSK    0x000F0000U  /*!< 0x000F0000U                                  */
/**
  * @}
  */
/** @defgroup SDMMC_MMC_Card_Voltage_Range MMC Card Voltage Range definition
  * @{
  */
#define SDMMC_MMC_HIGH_VOLTAGE_RANGE                    0x80FF8000U  /*!< High voltage in byte mode   */
#define SDMMC_MMC_DUAL_VOLTAGE_RANGE                    0x80FF8080U  /*!< Dual voltage in byte mode   */
#define SDMMC_MMC_LOW_VOLTAGE_RANGE                     0x80000080U  /*!< Low voltage in byte mode    */
#define SDMMC_EMMC_HIGH_VOLTAGE_RANGE                   0xC0FF8000U  /*!< High voltage in sector mode */
#define SDMMC_EMMC_DUAL_VOLTAGE_RANGE                   0xC0FF8080U  /*!< Dual voltage in sector mode */
#define SDMMC_EMMC_LOW_VOLTAGE_RANGE                    0xC0000080U  /*!< Low voltage in sector mode  */
#define SDMMC_MMC_INVALID_VOLTAGE_RANGE                 0x0001FF01U  /*!< Invalid voltage Range       */
/**
  * @}
  */

/** @defgroup MMC_Card_Extended_Specific_Data MMC Card Extended Specific Data definition
  * @{
  */
/*------------------------------------  Bit definition for MMC CARD EXT CSD register ---------------------------------*/
#define SDMMC_MMC_EXT_CSD_SECURE_REMOVAL_IDX      16U          /*!< Secure Removal type index           */
#define SDMMC_MMC_EXT_CSD_SECURE_REMOVAL_POS      0U           /*!< Secure Removal type position        */
#define SDMMC_MMC_EXT_CSD_SECURE_REMOVAL_MSK      0x000000FFU  /*!< Secure Removal type msk             */

#define SDMMC_MMC_EXT_CSD_DEVICE_TYPE_IDX         196U         /*!< Device Type index                   */
#define SDMMC_MMC_EXT_CSD_DEVICE_TYPE_POS         8U           /*!< Device Type position                */
#define SDMMC_MMC_EXT_CSD_DEVICE_TYPE_MSK         0x0000FF00U  /*!< Device Type msk                     */

#define SDMMC_MMC_EXT_CSD_DATA_SECTOR_SIZE_IDX    61U          /*!< Data Sector size index              */
#define SDMMC_MMC_EXT_CSD_DATA_SECTOR_SIZE_POS    8U           /*!< Data Sector size position           */
#define SDMMC_MMC_EXT_CSD_DATA_SECTOR_SIZE_MSK    0x0000FF00U  /*!< Data Sector Size msk                */

#define SDMMC_MMC_EXT_CSD_PWR_CLASS_SIZE_IDX      187U         /*!< Power Class index                   */
#define SDMMC_MMC_EXT_CSD_PWR_CLASS_SIZE_POS      24U          /*!< Power Class position                */
#define SDMMC_MMC_EXT_CSD_PWR_CLASS_SIZE_MSK      0xFF000000U  /*!< Power Class msk                     */

#define SDMMC_MMC_EXT_CSD_SECTOR_COUNT_SIZE_IDX   212U         /*!< Sector Count index                  */
#define SDMMC_MMC_EXT_CSD_SECTOR_COUNT_SIZE_POS   0U           /*!< Sector Count position               */
#define SDMMC_MMC_EXT_CSD_SECTOR_COUNT_SIZE_MSK   0xFFFFFFFFU  /*!< Sector Count msk                    */

#define SDMMC_MMC_EXT_CSD_SLEEP_NOTIF_TIME_IDX    216U         /*!< Sleep Notification timeout index    */
#define SDMMC_MMC_EXT_CSD_SLEEP_NOTIF_TIME_POS    0U           /*!< Sleep Notification timeout position */
#define SDMMC_MMC_EXT_CSD_SLEEP_NOTIF_TIME_MSK    0xFFU        /*!< Sleep Notification timeout msk      */

#define SDMMC_MMC_EXT_CSD_S_A_TIMEOUT_IDX         217U         /*!< Sleep Awake timeout index           */
#define SDMMC_MMC_EXT_CSD_S_A_TIMEOUT_POS         8U           /*!< Sleep Awake timeout position        */
#define SDMMC_MMC_EXT_CSD_S_A_TIMEOUT_MSK         0x0000FF00U  /*!< Sleep Awake timeout msk             */

#define MMC_EXT_CSD_PARTITION_SWITCH_TIME_IDX     199U         /*!< Partition switching timing index    */
#define MMC_EXT_CSD_PARTITION_SWITCH_TIME_POS     24U          /*!< Partition switching timing position */
#define MMC_EXT_CSD_PARTITION_SWITCH_TIME_MSK     0xFF000000U  /*!< Partition switching timing msk      */

#define MMC_EXT_CSD_RPMB_SIZE_MULT_IDX            168U         /*!< RPMB Partition size index           */
#define MMC_EXT_CSD_RPMB_SIZE_MULT_POS            0U           /*!< RPMB Partition size position        */
#define MMC_EXT_CSD_RPMB_SIZE_MULT_MSK            0x000000FFU  /*!< RPMB Partition size msk             */

#if defined (VDD_VALUE) && (VDD_VALUE <= 1950U)
#define MMC_VOLTAGE_RANGE                         SDMMC_EMMC_LOW_VOLTAGE_RANGE /*!< EMMC voltage range */
#define SDMMC_MMC_EXT_CSD_PWR_CL_26_IDX           201U        /*!< Power class for 26 MHz at 1.95 V 1 R index    */
#define SDMMC_MMC_EXT_CSD_PWR_CL_26_POS           8U          /*!< Power class for 26 MHz at 1.95 V 1 R position */
#define SDMMC_MMC_EXT_CSD_PWR_CL_26_MSK           0x0000FF00U /*!< 0x0000FF00U                                   */

#define SDMMC_MMC_EXT_CSD_PWR_CL_52_IDX           200U        /*!< Power class for 52 MHz at 1.95 V 1 R index    */
#define SDMMC_MMC_EXT_CSD_PWR_CL_52_POS           0U          /*!< Power class for 52 MHz at 1.95 V 1 R position */
#define SDMMC_MMC_EXT_CSD_PWR_CL_52_MSK           0x000000FFU /*!< 0x000000FFU                                   */

#define SDMMC_MMC_EXT_CSD_PWR_CL_DDR_52_IDX       238U        /*!< Power class for 52MHz, DDR at VCC = 1.95V index    */
#define SDMMC_MMC_EXT_CSD_PWR_CL_DDR_52_POS       16U         /*!< Power class for 52MHz, DDR at VCC = 1.95V position */
#define SDMMC_MMC_EXT_CSD_PWR_CL_DDR_52_MSK       0x00FF0000U /*!< 0x00FF0000U                                        */

#else
#define MMC_VOLTAGE_RANGE                         SDMMC_MMC_HIGH_VOLTAGE_RANGE /*!< MMC voltage range */
#define SDMMC_MMC_EXT_CSD_PWR_CL_26_IDX           203U        /*!< Power class for 26 MHz at 3.6 V 1 R index         */
#define SDMMC_MMC_EXT_CSD_PWR_CL_26_POS           24U         /*!< Power class for 26 MHz at 3.6 V 1 R position      */
#define SDMMC_MMC_EXT_CSD_PWR_CL_26_MSK           0xFF000000U /*!< 0xFF000000U                                       */

#define SDMMC_MMC_EXT_CSD_PWR_CL_52_IDX           202U        /*!< Power class for 52 MHz at 3.6 V 1 R index         */
#define SDMMC_MMC_EXT_CSD_PWR_CL_52_POS           16U         /*!< Power class for 52 MHz at 3.6 V 1 R position      */
#define SDMMC_MMC_EXT_CSD_PWR_CL_52_MSK           0x00FF0000U /*!< 0x00FF0000U                                       */

