STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
#define SDMMC_MMC_EXT_CSD_PWR_CL_DDR_52_IDX       239U        /*!< Power class for 52MHz, DDR at VCC = 3.6V index    */
#define SDMMC_MMC_EXT_CSD_PWR_CL_DDR_52_POS       24U         /*!< Power class for 52MHz, DDR at VCC = 3.6V position */
#define SDMMC_MMC_EXT_CSD_PWR_CL_DDR_52_MSK       0xFF000000U /*!< 0xFF000000U                                       */

#define SDMMC_MMC_VOLTAGE_RANGE_MSK               0xFF000000U /*!< 0xFF000000U MMC voltage range Msk                 */
#define SDMMC_MMC_VOLTAGE_RANGE_POS               24U         /*!< MMC voltage range position                        */
#define SDMMC_MMC_VOLTAGE_RANGE_COMPATIBLE        0xC0U       /*!< MMC voltage range compatible to the host CMD1 arg */
#endif /* (VDD_VALUE) && (VDD_VALUE <= 1950U)*/
/**
  * @}
  */

/** @defgroup MMC_Card_System_Specification_Version MMC Card System specification version definition
  * @{
  */
#define SDMMC_MMC_CARD_SYSTEM_SPEC_VERSION_POS           26U          /*!< MMC Card system spec version position */
#define SDMMC_MMC_CARD_SYSTEM_SPEC_VERSION_MSK           0x3C000000U  /*!< 0x3C000000U                           */
/**
  * @}
  */

/** @defgroup SDMMC_SD_CARD_STATUS_register SDMMC SD Card Status register definition
  * @{
  */
#define SDMMC_SD_CARD_DATA_BUS_WIDTH_POS         30U          /*!< SD card data bus width position              */
#define SDMMC_SD_CARD_DATA_BUS_WIDTH_MSK         0xC0000000U  /*!< 0xC0000000U                                  */
#define SDMMC_SD_CARD_SECURED_MODE_POS           29U          /*!< SD card secured mode position                */
#define SDMMC_SD_CARD_SECURED_MODE_MSK           0x20000000U  /*!< 0x20000000U                                  */
#define SDMMC_SD_CARD_TYPE_POS                   0U           /*!< SD card type position                        */
#define SDMMC_SD_CARD_TYPE_MSK                   0x0000FFFFU  /*!< 0x0000FFFFU                                  */
#define SDMMC_SD_CARD_SIZE_OF_PROTECTED_AREA_POS 0U           /*!< SD card size of protected area position      */
#define SDMMC_SD_CARD_SIZE_OF_PROTECTED_AREA_MSK 0xFFFFFFFFU  /*!< 0xFFFFFFFFU                                  */
#define SDMMC_SD_CARD_SPEED_CLASS_POS            24U          /*!< SD card speed class position                 */
#define SDMMC_SD_CARD_SPEED_CLASS_MSK            0xFF000000U  /*!< 0xFF000000U                                  */
#define SDMMC_SD_CARD_PERFORMANCE_MOVE_POS       16U          /*!< SD card performance of move position         */
#define SDMMC_SD_CARD_PERFORMANCE_MOVE_MSK       0x00FF0000U  /*!< 0x00FF0000U                                  */
#define SDMMC_SD_CARD_AU_SIZE_POS                12U          /*!< SD card allocation unit size position        */
#define SDMMC_SD_CARD_AU_SIZE_MSK                0x0000F000U  /*!< 0x0000F000U                                  */
#define SDMMC_SD_CARD_ERASE_SIZE1_POS            0U           /*!< SD card erase size 1 position                */
#define SDMMC_SD_CARD_ERASE_SIZE1_MSK            0x000000FFU  /*!< 0x000000FFU                                  */
#define SDMMC_SD_CARD_ERASE_SIZE2_POS            24U          /*!< SD card erase size 2 position                */
#define SDMMC_SD_CARD_ERASE_SIZE2_MSK            0xFF000000U  /*!< 0xFF000000U                                  */
#define SDMMC_SD_CARD_ERASE_TIMEOUT_POS          18U          /*!< SD card erase timeout position               */
#define SDMMC_SD_CARD_ERASE_TIMEOUT_MSK          0x00FC0000U  /*!< 0x00FC0000U                                  */
#define SDMMC_SD_CARD_ERASE_OFFSET_POS           16U          /*!< SD card erase offset position                */
#define SDMMC_SD_CARD_ERASE_OFFSET_MSK           0x00030000U  /*!< 0x00030000U                                  */
#define SDMMC_SD_CARD_UHS_SPEED_GRADE_POS        12U          /*!< SD card speed grade of UHS mode position     */
#define SDMMC_SD_CARD_UHS_SPEED_GRADE_MSK        0x0000F000U  /*!< 0x0000F000U                                  */
#define SDMMC_SD_CARD_UHS_AU_SIZE_POS            8U           /*!< SD card size of unit allocation UHS position */
#define SDMMC_SD_CARD_UHS_AU_SIZE_MSK            0x00000F00U  /*!< 0x00000F00U                                  */
#define SDMMC_SD_CARD_VIDEO_SPEED_CLASS_POS      0U           /*!< SD card video speed class value position     */
#define SDMMC_SD_CARD_VIDEO_SPEED_CLASS_MSK      0x000000FFU  /*!< 0x000000FFU                                  */
/**
  * @}
  */

/** @defgroup SDMMC_SD_CARD_SPECIFIC_DATA SDMMC SDMMC SD Card Specific datat definition
  * @{
  */
#define SDMMC_SD_CARD_SDHC_SDXC_CSD_DEVICE_SIZE1_POS    16U          /*!< SD card SDHC SDXC CSD device size position  */
#define SDMMC_SD_CARD_SDHC_SDXC_CSD_DEVICE_SIZE1_MSK    0xFFFF0000U  /*!< 0xFFFF0000U                                 */
#define SDMMC_SD_CARD_SDHC_SDXC_CSD_DEVICE_SIZE2_POS    0U           /*!< SD card CSD device size position            */
#define SDMMC_SD_CARD_SDHC_SDXC_CSD_DEVICE_SIZE2_MSK    0x0000003FU  /*!< 0x0000003FU                                 */
#define SDMMC_SD_CARD_SDSC_CSD_DEVICE_SIZE1_POS         30U          /*!< SD card SDSC CSD device size position       */
#define SDMMC_SD_CARD_SDSC_CSD_DEVICE_SIZE1_MSK         0xC0000000U  /*!< 0xC0000000U                                 */
#define SDMMC_SD_CARD_SDSC_CSD_DEVICE_SIZE2_POS         0U           /*!< SD card SDSC CSD device size position       */
#define SDMMC_SD_CARD_SDSC_CSD_DEVICE_SIZE2_MSK         0x000003FFU  /*!< 0x000003FFU                                 */
#define SDMMC_SD_CARD_SDSC_CSD_DEVICE_SIZE_MULTIPLE_POS 15U          /*!< SD card SDSC CSD device multiple position   */
#define SDMMC_SD_CARD_SDSC_CSD_DEVICE_SIZE_MULTIPLE_MSK 0x00038000U  /*!< 0x00038000U                                 */
#define SDMMC_SD_CARD_SDSC_CSD_READ_BL_LEN_POS          16U          /*!< SD card SDSC CSD read block length position */
#define SDMMC_SD_CARD_SDSC_CSD_READ_BL_LEN_MSK          0x000F0000U  /*!< 0x000F0000U                                 */
/**
  * @}
  */

