STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/** @defgroup SDMMC_DATA_BUFFER_STATE SDMMC Data Buffer State definition
  * @{
  */
#define SDMMC_DATA_BUFFER_STATE_NOT_READY    0U  /*!< SDMMC Data Buffer State Not Ready */
#define SDMMC_DATA_BUFFER_STATE_READY        1U  /*!< SDMMC Data Buffer State Ready     */
/**
  * @}
  */

/**
  * @}
  */
/* Private macro -----------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_Private_Macros SDMMC Private Macros
  * @{
  */
/*! Get SDMMC instance macros */
#if defined (SDMMC2)
#define SDMMC_GET_DLYB_INSTANCE(instance) ((instance == SDMMC1) ? DLYB_SDMMC1 : DLYB_SDMMC2)
#else
#define SDMMC_GET_DLYB_INSTANCE(instance) \
  ({                                      \
    STM32_UNUSED(instance);               \
    DLYB_SDMMC1;                          \
  })
#endif /* SDMMC2 */
/**
  * @}
  */

/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_CORE_Exported_macros SDMMC_CORE Exported Macros
  * @{
  */
#define SDMMC_READ_REG(instance, reg)               READ_REG((instance)->reg)
#define SDMMC_SET_PWR_STATE(instance, state)        MODIFY_REG((instance)->POWER, SDMMC_POWER_PWRCTRL, (state))
#define SDMMC_GET_PWR_STATE(instance)               READ_BIT((instance)->POWER, SDMMC_POWER_PWRCTRL)
#define SDMMC_ENABLE_VOLTAGE_SWITCH(instance)       SET_BIT((instance)->POWER, SDMMC_POWER_VSWITCHEN)
#define SDMMC_START_VOLTAGE_SWITCH(instance)        SET_BIT((instance)->POWER, SDMMC_POWER_VSWITCH)
#define SDMMC_DISABLE_VOLTAGE_SWITCH(instance)      CLEAR_BIT((instance)->POWER, SDMMC_POWER_VSWITCH \
                                                              | SDMMC_POWER_VSWITCHEN)
#define SDMMC_SET_DIRECTION_LOW_POLARITY(instance)  CLEAR_BIT((instance)->POWER, SDMMC_POWER_DIRPOL)
#define SDMMC_SET_DIRECTION_HIGH_POLARITY(instance) SET_BIT((instance)->POWER, SDMMC_POWER_DIRPOL)
#define SDMMC_READ_FIELD(val, msk, pos)             (((uint32_t)(val) & (msk)) >> (pos))

/**
  * @brief  Enable the SDMMC device interrupt.
  * @param  instance Pointer to SDMMC register base
  * @param  interrupt specifies the SDMMC interrupt sources to be enabled.
  *         This parameter can be one or a combination of the following values:
  *            @arg SDMMC_IT_CCRCFAIL:   Command response received (CRC check failed) interrupt
  *            @arg SDMMC_IT_DCRCFAIL:   Data block sent/received (CRC check failed) interrupt
  *            @arg SDMMC_IT_CTIMEOUT:   Command response timeout interrupt
  *            @arg SDMMC_IT_DTIMEOUT:   Data timeout interrupt
  *            @arg SDMMC_IT_TXUNDERR:   Transmit FIFO underrun error interrupt
  *            @arg SDMMC_IT_RXOVERR:    Received FIFO overrun error interrupt
  *            @arg SDMMC_IT_CMDREND:    Command response received (CRC check passed) interrupt
  *            @arg SDMMC_IT_CMDSENT:    Command sent (no response required) interrupt
  *            @arg SDMMC_IT_DATAEND:    Data end (data counter, DATACOUNT, is zero) interrupt
  *            @arg SDMMC_IT_DHOLD:      Data transfer Hold interrupt
  *            @arg SDMMC_IT_DBCKEND:    Data block sent/received (CRC check passed) interrupt
  *            @arg SDMMC_IT_DABORT:     Data transfer aborted by CMD12 interrupt
  *            @arg SDMMC_IT_TXFIFOHE:   Transmit FIFO Half Empty interrupt
  *            @arg SDMMC_IT_RXFIFOHF:   Receive FIFO Half Full interrupt
  *            @arg SDMMC_IT_RXFIFOF:    Receive FIFO full interrupt
  *            @arg SDMMC_IT_TXFIFOE:    Transmit FIFO empty interrupt
  *            @arg SDMMC_IT_BUSYD0END:  End of SDMMC_D0 Busy following a CMD response detected interrupt
  *            @arg SDMMC_IT_SDIOIT:     SDIO interrupt received interrupt
  *            @arg SDMMC_IT_ACKFAIL:    Boot Acknowledgment received interrupt
  *            @arg SDMMC_IT_ACKTIMEOUT: Boot Acknowledgment timeout interrupt
  *            @arg SDMMC_IT_VSWEND:     Voltage switch critical timing section completion interrupt
  *            @arg SDMMC_IT_CKSTOP:     SDMMC_CK stopped in Voltage switch procedure interrupt
  *            @arg SDMMC_IT_IDMABTC:    IDMA buffer transfer complete interrupt
  */
#define SDMMC_ENABLE_IT(instance, interrupt) ((instance)->MASKR |= (interrupt))

/**
  * @brief  Disable the SDMMC device interrupt.
  * @param  instance Pointer to SDMMC register base
  * @param  interrupt specifies the SDMMC interrupt sources to be disabled.
  *          This parameter can be one or a combination of the following values:
  *            @arg SDMMC_IT_CCRCFAIL:   Command response received (CRC check failed) interrupt
  *            @arg SDMMC_IT_DCRCFAIL:   Data block sent/received (CRC check failed) interrupt
  *            @arg SDMMC_IT_CTIMEOUT:   Command response timeout interrupt
  *            @arg SDMMC_IT_DTIMEOUT:   Data timeout interrupt
  *            @arg SDMMC_IT_TXUNDERR:   Transmit FIFO underrun error interrupt
  *            @arg SDMMC_IT_RXOVERR:    Received FIFO overrun error interrupt
  *            @arg SDMMC_IT_CMDREND:    Command response received (CRC check passed) interrupt
  *            @arg SDMMC_IT_CMDSENT:    Command sent (no response required) interrupt
  *            @arg SDMMC_IT_DATAEND:    Data end (data counter, DATACOUNT, is zero) interrupt
  *            @arg SDMMC_IT_DHOLD:      Data transfer Hold interrupt
  *            @arg SDMMC_IT_DBCKEND:    Data block sent/received (CRC check passed) interrupt
  *            @arg SDMMC_IT_DABORT:     Data transfer aborted by CMD12 interrupt
  *            @arg SDMMC_IT_TXFIFOHE:   Transmit FIFO Half Empty interrupt
  *            @arg SDMMC_IT_RXFIFOHF:   Receive FIFO Half Full interrupt
  *            @arg SDMMC_IT_RXFIFOF:    Receive FIFO full interrupt
  *            @arg SDMMC_IT_TXFIFOE:    Transmit FIFO empty interrupt
  *            @arg SDMMC_IT_BUSYD0END:  End of SDMMC_D0 Busy following a CMD response detected interrupt
  *            @arg SDMMC_IT_SDIOIT:     SDIO interrupt received interrupt
  *            @arg SDMMC_IT_ACKFAIL:    Boot Acknowledgment received interrupt
  *            @arg SDMMC_IT_ACKTIMEOUT: Boot Acknowledgment timeout interrupt
  *            @arg SDMMC_IT_VSWEND:     Voltage switch critical timing section completion interrupt
  *            @arg SDMMC_IT_CKSTOP:     SDMMC_CK stopped in Voltage switch procedure interrupt
  *            @arg SDMMC_IT_IDMABTC:    IDMA buffer transfer complete interrupt
  */
#define SDMMC_DISABLE_IT(instance, interrupt) ((instance)->MASKR &= ~(interrupt))

/**
  * @brief  Checks whether the specified SDMMC flag is set or not.
  * @param  instance Pointer to SDMMC register base
  * @param  flag specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg SDMMC_FLAG_CCRCFAIL:   Command response received (CRC check failed)
  *            @arg SDMMC_FLAG_DCRCFAIL:   Data block sent/received (CRC check failed)
  *            @arg SDMMC_FLAG_CTIMEOUT:   Command response timeout
  *            @arg SDMMC_FLAG_DTIMEOUT:   Data timeout
  *            @arg SDMMC_FLAG_TXUNDERR:   Transmit FIFO underrun error
  *            @arg SDMMC_FLAG_RXOVERR:    Received FIFO overrun error
  *            @arg SDMMC_FLAG_CMDREND:    Command response received (CRC check passed)
  *            @arg SDMMC_FLAG_CMDSENT:    Command sent (no response required)
  *            @arg SDMMC_FLAG_DATAEND:    Data end (data counter, DATACOUNT, is zero)
  *            @arg SDMMC_FLAG_DHOLD:      Data transfer Hold
  *            @arg SDMMC_FLAG_DBCKEND:    Data block sent/received (CRC check passed)
  *            @arg SDMMC_FLAG_DABORT:     Data transfer aborted by CMD12
  *            @arg SDMMC_FLAG_DPSMACT:    Data path state machine active
  *            @arg SDMMC_FLAG_CPSMACT:    Command path state machine active
  *            @arg SDMMC_FLAG_TXFIFOHE:   Transmit FIFO Half Empty
  *            @arg SDMMC_FLAG_RXFIFOHF:   Receive FIFO Half Full
  *            @arg SDMMC_FLAG_TXFIFOF:    Transmit FIFO full
  *            @arg SDMMC_FLAG_RXFIFOF:    Receive FIFO full
  *            @arg SDMMC_FLAG_TXFIFOE:    Transmit FIFO empty
  *            @arg SDMMC_FLAG_RXFIFOE:    Receive FIFO empty
  *            @arg SDMMC_FLAG_BUSYD0:     Inverted value of SDMMC_D0 line (Busy)
  *            @arg SDMMC_FLAG_BUSYD0END:  End of SDMMC_D0 Busy following a CMD response detected
  *            @arg SDMMC_FLAG_SDIOIT:     SDIO interrupt received
  *            @arg SDMMC_FLAG_ACKFAIL:    Boot Acknowledgment received
  *            @arg SDMMC_FLAG_ACKTIMEOUT: Boot Acknowledgment timeout
  *            @arg SDMMC_FLAG_VSWEND:     Voltage switch critical timing section completion
  *            @arg SDMMC_FLAG_CKSTOP:     SDMMC_CK stopped in Voltage switch procedure
  *            @arg SDMMC_FLAG_IDMATE:     IDMA transfer error
  *            @arg SDMMC_FLAG_IDMABTC:    IDMA buffer transfer complete
  * @retval The new state of SDMMC_FLAG (SET or RESET).
  */
#define SDMMC_IS_ACTIVE_FLAG(instance, flag) (((instance)->STAR & (flag)) != 0U)

/**
  * @brief  Clears the SDMMC pending flags.
  * @param  instance Pointer to SDMMC register base
  * @param  flag specifies the flag to clear.
  *          This parameter can be one or a combination of the following values:
  *            @arg SDMMC_FLAG_CCRCFAIL:   Command response received (CRC check failed)
  *            @arg SDMMC_FLAG_DCRCFAIL:   Data block sent/received (CRC check failed)
  *            @arg SDMMC_FLAG_CTIMEOUT:   Command response timeout
  *            @arg SDMMC_FLAG_DTIMEOUT:   Data timeout
  *            @arg SDMMC_FLAG_TXUNDERR:   Transmit FIFO underrun error
  *            @arg SDMMC_FLAG_RXOVERR:    Received FIFO overrun error
  *            @arg SDMMC_FLAG_CMDREND:    Command response received (CRC check passed)
  *            @arg SDMMC_FLAG_CMDSENT:    Command sent (no response required)
  *            @arg SDMMC_FLAG_DATAEND:    Data end (data counter, DATACOUNT, is zero)
  *            @arg SDMMC_FLAG_DHOLD:      Data transfer Hold
  *            @arg SDMMC_FLAG_DBCKEND:    Data block sent/received (CRC check passed)
  *            @arg SDMMC_FLAG_DABORT:     Data transfer aborted by CMD12
  *            @arg SDMMC_FLAG_BUSYD0END:  End of SDMMC_D0 Busy following a CMD response detected
  *            @arg SDMMC_FLAG_SDIOIT:     SDIO interrupt received
  *            @arg SDMMC_FLAG_ACKFAIL:    Boot Acknowledgment received
  *            @arg SDMMC_FLAG_ACKTIMEOUT: Boot Acknowledgment timeout
  *            @arg SDMMC_FLAG_VSWEND:     Voltage switch critical timing section completion
  *            @arg SDMMC_FLAG_CKSTOP:     SDMMC_CK stopped in Voltage switch procedure
  *            @arg SDMMC_FLAG_IDMATE:     IDMA transfer error
  *            @arg SDMMC_FLAG_IDMABTC:    IDMA buffer transfer complete
  */
#define SDMMC_CLEAR_FLAG(instance, flag) ((instance)->ICR = (flag))

/**
  * @brief  Checks whether the specified SDMMC interrupt has occurred or not.
  * @param  instance Pointer to SDMMC register base
  * @param  interrupt specifies the SDMMC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg SDMMC_IT_CCRCFAIL:   Command response received (CRC check failed) interrupt
  *            @arg SDMMC_IT_DCRCFAIL:   Data block sent/received (CRC check failed) interrupt
  *            @arg SDMMC_IT_CTIMEOUT:   Command response timeout interrupt
  *            @arg SDMMC_IT_DTIMEOUT:   Data timeout interrupt
  *            @arg SDMMC_IT_TXUNDERR:   Transmit FIFO underrun error interrupt
  *            @arg SDMMC_IT_RXOVERR:    Received FIFO overrun error interrupt
  *            @arg SDMMC_IT_CMDREND:    Command response received (CRC check passed) interrupt
  *            @arg SDMMC_IT_CMDSENT:    Command sent (no response required) interrupt
  *            @arg SDMMC_IT_DATAEND:    Data end (data counter, DATACOUNT, is zero) interrupt
  *            @arg SDMMC_IT_DHOLD:      Data transfer Hold interrupt
  *            @arg SDMMC_IT_DBCKEND:    Data block sent/received (CRC check passed) interrupt
  *            @arg SDMMC_IT_DABORT:     Data transfer aborted by CMD12 interrupt
  *            @arg SDMMC_IT_TXFIFOHE:   Transmit FIFO Half Empty interrupt
  *            @arg SDMMC_IT_RXFIFOHF:   Receive FIFO Half Full interrupt
  *            @arg SDMMC_IT_RXFIFOF:    Receive FIFO full interrupt
  *            @arg SDMMC_IT_TXFIFOE:    Transmit FIFO empty interrupt
  *            @arg SDMMC_IT_BUSYD0END:  End of SDMMC_D0 Busy following a CMD response detected interrupt
  *            @arg SDMMC_IT_SDIOIT:     SDIO interrupt received interrupt
  *            @arg SDMMC_IT_ACKFAIL:    Boot Acknowledgment received interrupt
  *            @arg SDMMC_IT_ACKTIMEOUT: Boot Acknowledgment timeout interrupt
  *            @arg SDMMC_IT_VSWEND:     Voltage switch critical timing section completion interrupt
  *            @arg SDMMC_IT_CKSTOP:     SDMMC_CK stopped in Voltage switch procedure interrupt
  *            @arg SDMMC_IT_IDMABTC:    IDMA buffer transfer complete interrupt
  * @retval The new state of SDMMC_IT (SET or RESET).
  */
#define SDMMC_GET_IT(instance, interrupt) (((instance)->STAR &(interrupt)) == (interrupt))

/**
  * @brief  Clears the SDMMC's interrupt pending bits.
  * @param  instance Pointer to SDMMC register base
  * @param  interrupt specifies the interrupt pending bit to clear.
  *          This parameter can be one or a combination of the following values:
  *            @arg SDMMC_IT_CCRCFAIL:   Command response received (CRC check failed) interrupt
  *            @arg SDMMC_IT_DCRCFAIL:   Data block sent/received (CRC check failed) interrupt
  *            @arg SDMMC_IT_CTIMEOUT:   Command response timeout interrupt
  *            @arg SDMMC_IT_DTIMEOUT:   Data timeout interrupt
  *            @arg SDMMC_IT_TXUNDERR:   Transmit FIFO underrun error interrupt
  *            @arg SDMMC_IT_RXOVERR:    Received FIFO overrun error interrupt
  *            @arg SDMMC_IT_CMDREND:    Command response received (CRC check passed) interrupt
  *            @arg SDMMC_IT_CMDSENT:    Command sent (no response required) interrupt
  *            @arg SDMMC_IT_DATAEND:    Data end (data counter, DATACOUNT, is zero) interrupt
  *            @arg SDMMC_IT_DHOLD:      Data transfer Hold interrupt
  *            @arg SDMMC_IT_DBCKEND:    Data block sent/received (CRC check passed) interrupt
  *            @arg SDMMC_IT_DABORT:     Data transfer aborted by CMD12 interrupt
  *            @arg SDMMC_IT_BUSYD0END:  End of SDMMC_D0 Busy following a CMD response detected interrupt
  *            @arg SDMMC_IT_SDIOIT:     SDIO interrupt received interrupt
  *            @arg SDMMC_IT_ACKFAIL:    Boot Acknowledgment received interrupt
  *            @arg SDMMC_IT_ACKTIMEOUT: Boot Acknowledgment timeout interrupt
  *            @arg SDMMC_IT_VSWEND:     Voltage switch critical timing section completion interrupt
  *            @arg SDMMC_IT_CKSTOP:     SDMMC_CK stopped in Voltage switch procedure interrupt
  *            @arg SDMMC_IT_IDMABTC:    IDMA buffer transfer complete interrupt
  */
#define SDMMC_CLEAR_IT(instance, interrupt) ((instance)->ICR = (interrupt))

/**
  * @brief  Enable Start the SD I/O Read Wait operation.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_START_READWAIT_ENABLE(instance) ((instance)->DCTRL |= SDMMC_DCTRL_RWSTART)

/**
  * @brief  Disable Start the SD I/O Read Wait operations.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_START_READWAIT_DISABLE(instance) ((instance)->DCTRL &= ~SDMMC_DCTRL_RWSTART)

/**
  * @brief  Enable Start the SD I/O Read Wait operation.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_STOP_READWAIT_ENABLE(instance) ((instance)->DCTRL |= SDMMC_DCTRL_RWSTOP)

/**
  * @brief  Disable Stop the SD I/O Read Wait operations.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_STOP_READWAIT_DISABLE(instance) ((instance)->DCTRL &= ~SDMMC_DCTRL_RWSTOP)

/**
  * @brief  Enable the SD I/O Mode Operation.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_OPERATION_ENABLE(instance) ((instance)->DCTRL |= SDMMC_DCTRL_SDIOEN)

/**
  * @brief  Disable the SD I/O Mode Operation.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_OPERATION_DISABLE(instance) ((instance)->DCTRL &= ~SDMMC_DCTRL_SDIOEN)

/**
  * @brief  Disable FIFO reset Operation.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_FIFORST_DISABLE(instance) ((instance)->DCTRL &= ~SDMMC_DCTRL_FIFORST)

/**
  * @brief  Enable FIFO reset Operation.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_FIFORST_ENABLE(instance)  ((instance)->DCTRL |= SDMMC_DCTRL_FIFORST)

/**
  * @brief  Clear SDMMC data control register
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CLEAR_DCTRL(instance) CLEAR_REG((instance)->DCTRL)

/**
  * @brief  Enable the SD I/O Suspend command sending.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_SUSPEND_CMD_ENABLE(instance) ((instance)->CMDR |= SDMMC_CMDR_CMDSUSPEND)

/**
  * @brief  Disable the SD I/O Suspend command sending.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_SUSPEND_CMD_DISABLE(instance) ((instance)->CMDR &= ~SDMMC_CMDR_CMDSUSPEND)

/**
  * @brief  Enable the CMDTRANS mode.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CMDTRANS_ENABLE(instance) ((instance)->CMDR |= SDMMC_CMDR_CMDTRANS)

/**
  * @brief  Disable the CMDTRANS mode.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CMDTRANS_DISABLE(instance) ((instance)->CMDR &= ~SDMMC_CMDR_CMDTRANS)

/**
  * @brief  Enable the CMDSTOP mode.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CMDSTOP_ENABLE(instance) ((instance)->CMDR |= SDMMC_CMDR_CMDSTOP)

/**
  * @brief  Disable the CMDSTOP mode.
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CMDSTOP_DISABLE(instance) ((instance)->CMDR &= ~SDMMC_CMDR_CMDSTOP)

/**
  * @brief  Clear SDMMC  data length register
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CLEAR_DLEN(instance) CLEAR_REG((instance)->DLENR)

/**
  * @brief  Set SDMMC clock control register
  * @param  instance Pointer to SDMMC register base
  * @param  flag Specifies the flag to clear.
  *          This parameter can be one or a combination of the following @ref SDMMC_CORE_Flags_sources.
  */
#define SDMMC_SET_CLKCR(instance, flag) SET_BIT(((instance)->CLKCR), flag)

/**
  * @brief  Set SDMMC DMA control register
  * @param  instance Pointer to SDMMC register base
  * @param  flag Specifies the flag to clear.
  *          This parameter can be one or a combination of @ref SDMMC_Internal_DMA_Mode.
  */
#define SDMMC_SET_IDMACTRL(instance, flag) SET_BIT(((instance)->IDMACTRLR), flag)

/**
  * @brief  Clear SDMMC DMA control register
  * @param  instance Pointer to SDMMC register base
  */
#define SDMMC_CLEAR_IDMACTRL(instance) CLEAR_REG(((instance)->IDMACTRLR))

/**
  * @brief  Modify SDMMC clock control register
  * @param  instance Pointer to SDMMC register base
  * @param  clear_mask Specifies the bits to clear.
  * @param  set_mask Specifies the bits to set.
  */
#define SDMMC_MODIFY_CLKCR(instance, clear_mask, set_mask) MODIFY_REG((instance)->CLKCR, clear_mask, set_mask)
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_CORE_Exported_Functions SDMMC Core Exported Functions
  * @{
  */
/** @defgroup SDMMC_CORE_Group1 Set and Get configurations functions
  * @{
  */
void SDMMC_SetConfig(SDMMC_TypeDef *sdmmcx, const sdmmc_config_t *p_config);
void SDMMC_GetConfig(SDMMC_TypeDef *sdmmcx, sdmmc_config_t *p_config);
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group2 Peripheral Control functions
  * @{
  */
/* Command path state machine (CPSM) management functions */
void SDMMC_SendCommand(SDMMC_TypeDef *sdmmcx, const sdmmc_cmd_init_t *p_command);

