STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.h
/* Data path state machine (DPSM) management functions */
void SDMMC_ConfigData(SDMMC_TypeDef *sdmmcx, const sdmmc_data_ctrl_t *p_data_ctrl);
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group3 SDMMC Commands management and Data transfers functions
  * @{
  */
uint32_t SDMMC_SendBlockLengthCmd(SDMMC_TypeDef *sdmmcx, uint32_t block_size);
uint32_t SDMMC_SendBlockCountCmd(SDMMC_TypeDef *SDMMCx, uint32_t block_count);
uint32_t SDMMC_SendReadBlocksCmd(SDMMC_TypeDef *sdmmcx, uint32_t read_addr, uint32_t read_blk_type);
uint32_t SDMMC_SendWriteBlocksCmd(SDMMC_TypeDef *sdmmcx, uint32_t write_addr, uint32_t write_blk_type);
uint32_t SDMMC_SendEraseCmd(SDMMC_TypeDef *sdmmcx, uint32_t start_addr, uint32_t cmd_erase, uint32_t erase_timeout_ms);
uint32_t SDMMC_SendStopTransferCmd(SDMMC_TypeDef *sdmmcx, uint32_t stop_transfer_timeout_ms);
uint32_t SDMMC_SendSelDeselCmd(SDMMC_TypeDef *sdmmcx, uint32_t addr);
uint32_t SDMMC_SendGoIdleStateCmd(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_SendOperCondCmd(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_SendAppCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_SendAppOperCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_SendBusWidthCmd(SDMMC_TypeDef *sdmmcx, uint32_t bus_width);
uint32_t SDMMC_SendSCRCmd(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_SendCIDCmd(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_SendCSDCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_SD_SendRelativeAddrCmd(SDMMC_TypeDef *sdmmcx, uint16_t *p_rca);
uint32_t SDMMC_SendStatusCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_SendStatusRegisterCmd(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_SendSwitchCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_MMC_SendSleepCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_SendVoltageSwitchCmd(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_SendOpConditionCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_MMC_SendRelativeAddrCmd(SDMMC_TypeDef *sdmmcx, uint16_t rca);
uint32_t SDMMC_MMC_SendEXTCSDCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);

uint32_t SDMMC_SDIO_SendReadWriteDirectCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument, uint8_t *p_response);
uint32_t SDMMC_SDIO_SendReadWriteExtendedCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument);
uint32_t SDMMC_SDIO_SendOperationconditionCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument, uint32_t *p_response);
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group4 SDMMC Responses management functions
  * @{
  */
uint32_t SDMMC_GetCmdResp1(SDMMC_TypeDef *sdmmcx, uint8_t cmd, uint32_t timeout_ms);
uint32_t SDMMC_GetCmdResp2(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_GetCmdResp3(SDMMC_TypeDef *sdmmcx);
uint32_t SDMMC_GetCmdResp4(SDMMC_TypeDef *sdmmcx, uint32_t *p_resp);
uint32_t SDMMC_GetCmdResp5(SDMMC_TypeDef *sdmmcx, uint8_t sdio_cmd, uint8_t *p_data);
uint32_t SDMMC_GetCmdResp6(SDMMC_TypeDef *sdmmcx, uint8_t cmd, uint16_t *p_rca);
uint32_t SDMMC_GetCmdResp7(SDMMC_TypeDef *sdmmcx);
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group5 SDMMC time calculation functions
  * @{
  */
void SDMMC_DelayMs(const SDMMC_TypeDef *sdmmcx, uint32_t delay_ms);
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group6 Read, Write and Get command response functions.
  * @{
  */
/**
  * @brief  Read data (word) from Rx FIFO in blocking mode (polling).
  * @param  sdmmcx Pointer to SDMMC register base.
  * @retval uint32_t data.
  */
__STATIC_INLINE uint32_t SDMMC_ReadFIFO(const SDMMC_TypeDef *sdmmcx)
{
  return (sdmmcx->FIFOR[0]);
}

/**
  * @brief Write data (word) to Tx FIFO in blocking mode (polling).
  * @param sdmmcx Pointer to SDMMC register base.
  * @param data   Specifies the data to put in FIFO.
  */
__STATIC_INLINE void SDMMC_WriteFIFO(SDMMC_TypeDef *sdmmcx, uint32_t data)
{
  sdmmcx->FIFOR[0] = data;
}

/**
  * @brief Return the command index of last command for which response received.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Command Index of the last command response received.
  */
__STATIC_INLINE uint8_t SDMMC_GetCommandResponse(const SDMMC_TypeDef *sdmmcx)
{
  return (uint8_t)(sdmmcx->RESPCMDR);
}

/**
  * @brief Return the response received from the card for the last command.
  * @param sdmmcx       Pointer to SDMMC register base.
  * @param response_reg Specifies the SDMMC response register.
  *         This parameter can be one of the following values:
  *           @arg SDMMC_RESP1: Response Register 1.
  *           @arg SDMMC_RESP2: Response Register 2.
  *           @arg SDMMC_RESP3: Response Register 3.
  *           @arg SDMMC_RESP4: Response Register 4.
  * @retval The Corresponding response register value.
  */
__STATIC_INLINE uint32_t SDMMC_GetResponse(const SDMMC_TypeDef *sdmmcx, uint32_t response_reg)
{
  return (*(__IO uint32_t *)((uint32_t)(&(sdmmcx->RESP1R)) + response_reg));
}

/**
  * @brief Returns number of remaining data bytes to be transferred.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Number of remaining data bytes to be transferred.
  */
__STATIC_INLINE uint32_t SDMMC_GetDataCounter(const SDMMC_TypeDef *sdmmcx)
{
  return (sdmmcx->DCNTR);
}

/**
  * @brief Sets one of the two options of inserting read wait interval.
  * @param sdmmcx               Pointer to SDMMC register base.
  * @param sdmmc_read_wait_mode SDMMC Read Wait operation mode.
  *         This parameter can be:
  *           @arg SDMMC_READ_WAIT_MODE_CLK: Read Wait control by stopping SDMMCCLK.
  *           @arg SDMMC_READ_WAIT_MODE_DATA2: Read Wait control using SDMMC_DATA2.
  */
__STATIC_INLINE void SDMMC_SetSDMMCReadWaitMode(SDMMC_TypeDef *sdmmcx, uint32_t sdmmc_read_wait_mode)
{
  /* Set SDMMC read wait mode */
  MODIFY_REG(sdmmcx->DCTRL, SDMMC_DCTRL_RWMOD, sdmmc_read_wait_mode);
}
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group7 SDMMC Linked-List functions
  * @{
  */
/**
  * @brief Set SDMMC linked list node data buffer state.
  * @param node_offset node offset value.
  * @param state       data buffer state.
  */
__STATIC_INLINE void SDMMC_SetNodeDataBufferState(uint32_t node_offset, uint32_t state)
{
  MODIFY_REG(node_offset, SDMMC_IDMALAR_ABR, state << SDMMC_IDMALAR_ABR_Pos);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif
#endif /* STM32U5XX_SDMMC_CORE_H */
